from aiogram import types
from aiogram.dispatcher import FSMContext
from aiogram.dispatcher.filters.builtin import Text
from aiogram.utils.markdown import hlink

from keyboards.inline.compatibility_kb import compatibility_ru, compatibility_en, compatibility_es, compatibility_de, \
    back_compatibility_ru, back_compatibility_en, back_compatibility_es, back_compatibility_de, comp_de, comp_es, \
    comp_en, comp_ru
from keyboards.inline.prdiction_kb import delete_msg_ru, delete_msg_en, delete_msg_es, delete_msg_de
from states.states import Compatibility
from utils.db_api import quick_commands as qc

from loader import dp
from telegraph import Telegraph


telegraph = Telegraph()


@dp.message_handler(Text(equals=["Совместимость", "Compatibility", "Compatibilidad", "Kompatibilität"]), state="*")
async def select_compatibility(message: types.Message, state: FSMContext):
    user = await qc.get_user(id=int(message.from_user.id))
    if user.language == "ru":
        await message.answer(f"Выберите режим", reply_markup=compatibility_ru)
    if user.language == "en":
        await message.answer(f"Select mode", reply_markup=compatibility_en)
    if user.language == "es":
        await message.answer(f"Seleccionar modo", reply_markup=compatibility_es)
    if user.language == "de":
        await message.answer(f"Auswahlmodus", reply_markup=compatibility_de)
    await state.finish()


@dp.callback_query_handler(text="compatibility_call_back", state="*")
async def compatibility_call_back(call: types.CallbackQuery, state: FSMContext):
    await call.message.delete_reply_markup()
    user = await qc.get_user(id=int(call.from_user.id))
    if user.language == "ru":
        await call.message.answer(f"Выберите режим", reply_markup=compatibility_ru)
    if user.language == "en":
        await call.message.answer(f"Select mode", reply_markup=compatibility_en)
    if user.language == "es":
        await call.message.answer(f"Seleccionar modo", reply_markup=compatibility_es)
    if user.language == "de":
        await call.message.answer(f"Auswahlmodus", reply_markup=compatibility_de)
    await state.finish()


@dp.callback_query_handler(text="compatibility_date")
async def compatibility_date(call: types.CallbackQuery):
    await call.message.delete()
    user = await qc.get_user(id=int(call.from_user.id))
    referrals = await qc.select_referrals(id=call.from_user.id)
    x = 0
    for referral in referrals:
        x += 1
    if user.language == "ru":
        if x < 3:
            await call.message.answer(f"Для активации функции пригласите минимум 3 людей.\n"
                                      f"Ваша ссылка для приглашения: ")
            await call.message.answer(f"https://t.me/horo_server_temp_bot?start={call.from_user.id}",
                                      reply_markup=comp_ru)
        else:
            user = await qc.get_user(id=int(call.from_user.id))
            await call.message.answer(f"Ваша дата рождения {user.birthday.replace(' ', '.')}\n"
                                      f"\n"
                                      f"Введите дату рождения партнера\n"
                                      f"<i>Например 21.04.1990</i>", reply_markup=back_compatibility_ru)
            await Compatibility.birthday.set()
    if user.language == "en":
        if x < 3:
            await call.message.answer(f"To activate the function, invite at least 3 people.\n"
                                      f"Your invitation link: ")
            await call.message.answer(f"https://t.me/horo_server_temp_bot?start={call.from_user.id}",
                                      reply_markup=comp_en)
        else:
            await call.message.answer(f"Enter your partner's date of birth\n"
                                      f"<i>For example 21/04/1990</i>", reply_markup=back_compatibility_en)
            await Compatibility.birthday.set()
    if user.language == "es":
        if x < 3:
            await call.message.answer(f"Para activar la función, invite al menos a 3 personas.\n"
                                      f"Su enlace de invitación: ")
            await call.message.answer(f"https://t.me/horo_server_temp_bot?start={call.from_user.id}",
                                      reply_markup=comp_es)
        else:
            await call.message.answer(f"Ingrese la fecha de nacimiento de su pareja\n"
                                      f"<i>Por ejemplo 21/04/1990</i>", reply_markup=back_compatibility_es)
            await Compatibility.birthday.set()
    if user.language == "de":
        if x < 3:
            await call.message.answer(f"Um die Funktion zu aktivieren, laden Sie mindestens 3 Personen ein.\n"
                                      f"Ihr Einladungslink: ")
            await call.message.answer(f"https://t.me/horo_server_temp_bot?start={call.from_user.id}",
                                      reply_markup=comp_de)
        else:
            await call.message.answer(f"Geben Sie das Geburtsdatum Ihres Partners ein\n"
                                      f"<i>Zum Beispiel 15.04.1990</i>", reply_markup=back_compatibility_de)
            await Compatibility.birthday.set()


@dp.message_handler(state=Compatibility.birthday)
async def compatibility_birthday(message: types.Message, state: FSMContext):
    try:
        date = message.text
    except:
        user = await qc.get_user(id=int(message.from_user.id))
        if user.language == "ru":
            await message.answer(f"Вы неправильно указали дату рождения, укажите ее в формате:\n"
                                 f"<b>дд.мм.гггг</b> или <b>дд,мм,гггг</b> или <b>дд/мм/гггг</b>", reply_markup=None)
        if user.language == "en":
            await message.answer(f"You entered your date of birth incorrectly, please enter it in the format:"
                                 f"<b>dd.mm.yyyy</b> or <b>dd,mm,yyyy</b> or <b>dd/mm/yyyy</b>", reply_markup=None)
        if user.language == "es":
            await message.answer(f"Ingresó incorrectamente su fecha de nacimiento, ingréselo en el formato:"
                                 f"<b>dd.mm.aaaa</b> o <b>dd,mm,aaaa</b> o <b>dd/mm/aaaa</b>", reply_markup=None)
        if user.language == "de":
            await message.answer(f"Sie haben Ihr Geburtsdatum falsch eingegeben, bitte geben Sie es im Format ein:"
                                 f"<b>dd.mm.yyyy</b> oder <b>dd,mm,yyyy</b> oder <b>dd/mm/yyyy</b>", reply_markup=None)
    try:
        date = date.replace(",", " ")
    except:
        print("нет такого символа для замены")
    try:
        date = date.replace(".", " ")
    except:
        print("нет такого символа для замены")
    try:
        date = date.replace("/", " ")
    except:
        print("нет такого символа для замены")
    date_split = date.split()
    try:
        print(int(date_split[0]), int(date_split[1]), int(date_split[2]))
        if 0 >= int(date_split[0]) or 31 < int(date_split[0]) or 0 > int(date_split[1]) or 12 < int(date_split[1]) \
                or 1910 >= int(date_split[2]) or int(date_split[2]) > 2021:
            user = await qc.get_user(id=int(message.from_user.id))
            if user.language == "ru":
                await message.answer(f"Вы неправильно указали дату рождения, укажите ее в формате:\n"
                                     f"<b>дд.мм.гггг</b> или <b>дд,мм,гггг</b> или <b>дд/мм/гггг</b>",
                                     reply_markup=None)
            if user.language == "en":
                await message.answer(
                    f"You entered your date of birth incorrectly, please enter it in the format:"
                    f"<b>dd.mm.yyyy</b> or <b>dd,mm,yyyy</b> or <b>dd/mm/yyyy</b>", reply_markup=None)
            if user.language == "es":
                await message.answer(f"Ingresó incorrectamente su fecha de nacimiento, ingréselo en el formato:"
                                     f"<b>dd.mm.aaaa</b> o <b>dd,mm,aaaa</b> o <b>dd/mm/aaaa</b>", reply_markup=None)
            if user.language == "de":
                await message.answer(f"Sie haben Ihr Geburtsdatum falsch eingegeben, bitte geben Sie es im Format ein:"
                                     f"<b>dd.mm.yyyy</b> oder <b>dd,mm,yyyy</b> oder <b>dd/mm/yyyy</b>",
                                     reply_markup=None)
        else:
            user = await qc.get_user(id=int(message.from_user.id))
            if user.language == "ru":
                date = message.text
                date_copy = date
                date_split = date.split()
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 1) or (
                        int(date_split[0]) <= 19 and int(date_split[1]) == 2):
                    recipient_zodiac = "Aquarius"
                if (int(date_split[0]) >= 20 and int(date_split[1]) == 2) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 3):
                    recipient_zodiac = "Pisces"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 3) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 4):
                    recipient_zodiac = "Aries"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 4) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 5):
                    recipient_zodiac = "Taurus"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 5) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 6):
                    recipient_zodiac = "Gemini"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 6) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 7):
                    recipient_zodiac = "Cancer"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 7) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 8):
                    recipient_zodiac = "Leo"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 8) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 9):
                    recipient_zodiac = "Virgo"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 9) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 10):
                    recipient_zodiac = "Libra"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 10) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 11):
                    recipient_zodiac = "Scorpio"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 11) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 12):
                    recipient_zodiac = "Sagittarius"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 12) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 1):
                    recipient_zodiac = "Capricorn"
                user_zodiac = user.zodiac
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                date = date.replace(" ", "")
                summa = 0
                summa1 = 0
                summa2 = 0
                summa3 = 0
                summa4 = 0
                summa5 = 0
                summa_user = 0
                summa_user1 = 0
                summa_user2 = 0
                summa_user3 = 0
                summa_user4 = 0
                summa_user5 = 0
                summa_recipient = 0
                summa_recipient1 = 0
                summa_recipient2 = 0
                summa_recipient3 = 0
                summa_recipient4 = 0
                summa_recipient5 = 0
                for i in user.birthday.replace(' ', ''):
                    summa_user += int(i)
                for i in str(summa_user):
                    summa_user1 += int(i)
                for i in str(summa_user1):
                    summa_user2 += int(i)
                for i in str(summa_user2):
                    summa_user3 += int(i)
                for i in str(summa_user3):
                    summa_user4 += int(i)
                for i in str(summa_user4):
                    summa_user5 += int(i)
                for i in date:
                    summa_recipient += int(i)
                for i in str(summa_recipient):
                    summa_recipient1 += int(i)
                for i in str(summa_recipient1):
                    summa_recipient2 += int(i)
                for i in str(summa_recipient2):
                    summa_recipient3 += int(i)
                for i in str(summa_recipient3):
                    summa_recipient4 += int(i)
                for i in str(summa_recipient4):
                    summa_recipient5 += int(i)
                for i in user.birthday.replace(' ', ''):
                    summa1 += int(i)
                for i in date:
                    summa1 += int(i)
                for i in str(summa1):
                    summa2 += int(i)
                for i in str(summa2):
                    summa3 += int(i)
                for i in str(summa3):
                    summa4 += int(i)
                for i in str(summa4):
                    summa5 += int(i)
                if summa5 == 1:
                    text = f"Главное для такого союза – действовать вместе. Здесь выявляется внутренний потенциал друг друга. " \
                           f"Такие отношения помогают общему развитию. Нельзя забывать, единица – это число лидера, поэтому могут " \
                           f"быть недоразумения из-за деления власти в отношениях. Могут появиться ссоры и выяснения отношений, " \
                           f"поэтому одному из партнёров просто необходимо научиться подчиняться другому, тогда и семейная жизнь, " \
                           f"и бизнес будут более гармоничными."
                if summa5 == 2:
                    text = "Такая пара держится на материальной основе. Людям очень нравится общаться друг с другом, но они в " \
                           "основном это делают из-за прибыли, потому что вместе им везёт. Нельзя отрицать и того, что со временем " \
                           "может получиться семья с хорошим достатком. Здесь тоже всё будет стабильно. Но даже если Вы просто ведёте" \
                           " бизнес, Ваша фирма будет процветать. Надо помнить, что двойка является земной цифрой, поэтому ей не " \
                           "свойственны яркие чувства. Могут даже появиться конфликты на почве денег. Такой союз не любит перемен и романтики."
                if summa5 == 3:
                    text = "Основные составляющие этого союза – умение общаться и быть непостоянными. Скучно здесь не будет. Хочется" \
                           " заметить, что уместнее в данном случае будут дружеские отношения, так как в семье с этой цифрой возникает " \
                           "холодность. Даются друг другу обещания и не выполняются. Могут быть измены с обеих сторон. Это, пожалуй, " \
                           "самое сложное число для совместимости."
                if summa5 == 4:
                    text = "Организованность, размеренность, постоянство, комфорт – составляющие данного союза. Семья будет " \
                           "излучать тепло и благополучие. Теплота в отношениях делает их искренними. Чрезмерная энергия может" \
                           " мешать деловой жизни пары. Здесь главное – это духовное обогащение, получение новых впечатлений, " \
                           "но неспособность увеличения капитала."
                if summa5 == 5:
                    text = "Один из самых сексуальных союзов, где кипят страсти. Партнёры доставляют друг другу много приятных " \
                           "моментов. Всё основано только на любви. Но это пара эгоистов. Надо научиться не только слушать, но и" \
                           " слышать друг друга, тогда всё будет хорошо и в семье появятся счастливые дети. Избыток энергии может " \
                           "быть направлен на любую отрасль в бизнесе и достаточно успешно."
                if summa5 == 6:
                    text = "Взаимопомощь и партнёрство – вот главные звенья этой пары. Это тоже земное число, поэтому и отношения " \
                           "бывают длительными. Для ведения бизнеса просто идеальный вариант. В семье – спокойствие, дружба, очень" \
                           " редко – выяснение отношений. Чувства могут угаснуть, а поддержка друг друга останется."
                if summa5 == 7:
                    text = "Основа этого союза – гармония. Партнёры умеют договариваться. Нельзя не заметить, что здесь могут " \
                           "забывать о выполнении договорных обязательств. Хотя скандалы практически не наблюдаются, помогает " \
                           "чувство такта, которое не доводит до разрыва отношения. Такие союзы довольно успешны. Совместно решаются " \
                           "все проблемы, как семейные, так и материальные."
                if summa5 == 8:
                    text = "В этой паре наблюдается некоторая странность, даже можно сказать – нестандартность. Людей сильно тянет " \
                           "друг к другу. Один партнёр, благодаря такому влечению, может подталкивать другого, тем самым помогая ему" \
                           " реализоваться в бизнесе. Но здесь может появиться внутреннее неудовлетворение, если первый поймёт, " \
                           "что его в чём-либо использует из чувства корысти второй. Если возникнет ссора, она может перерасти в " \
                           "грандиозный скандал. Надо научиться поднимать самооценку. В паре возможна ревность. Необходимо быть " \
                           "гибкими в данном союзе, тогда всё получится."
                if summa5 == 9:
                    text = "Самая философская пара. Если в материальном плане здесь всё будет благополучно – перед нами идеальная " \
                           "пара. Ну а при слабом финансовом положении отношения дают трещину. Поэтому здесь лучше дружить, а не " \
                           "создавать семейный союз, так как быт может поглотить обоих и развести в разные стороны. Если же всё-таки " \
                           "брак имеет место, то обязательно кто-то из партнёров должен брать на себя многие бытовые проблемы. " \
                           "Тогда союз будет гармоничным."
                if int(summa_user5) == 1:
                    text_for_user = "Люди с числом 1 привыкли быть лидером во всех отношениях,  считают, что их мнение – самое " \
                                    "верное и решения, которые они принимают – самые правильные. Это может негативно отразиться на" \
                                    " отношениях. Все должно быть, как они хотят, не принимают точку зрения другого партнера. Их идеальный " \
                                    "партнер с числом судьбы 3 или 5. Это те люди, которые применяют правильный подход к такой властной натуре," \
                                    " как вы. Партнер с числом судьбы 3 – простая и беззаботная натура. Он не любит ничего решать, поэтому будет " \
                                    "только рад, если все важные решения принимать будут не они. А человек с числом судьбы 5 – очень гибкая натура." \
                                    " Он умеет находить компромиссы, добавляет некую динамичность и позитивную энергию в отношения, и серьезная «единица», " \
                                    "попадая под его чары, становится беззаботнее и веселее. Также Людям с числом 1 подойдет партнер с числом судьбы 6." \
                                    " Но он подходит всем числам судьбы, потому что это самая гармоничная натура, которая привнесет в любые отношения доброту, уют и счастье.\n" \
                                    "Людям с числом 1 не стоит встречаться с «восьмерками» и другими «единицами». Оба числа любят авторитет, поэтому их ожидают частые споры и " \
                                    "конфликты на тему «кто главный», ибо двух капитанов на одном корабле быть не может."
                if int(summa_user5) == 2:
                    text_for_user = "Человек с числом 2— очень хрупкая эмоциональная натура, которая тем не менее использует искусные манипуляции в отношениях." \
                                    " Самые гармоничные отношения ожидаются с человеком, число судьбы которого 8 или 9. Решительная и авторитетная «восьмерка» " \
                                    "отлично сойдется с мягким характером «двойки». Партнер с числом судьбы 9 – это любящий защитник.Человеку с числом 2 подойдет" \
                                    " именно такой человек.\n" \
                                    "Приземленная и эмоционально-зависимая «четверка» или серьезный интроверт «семерка» могут стать Человеку с числом 2 хорошей парой," \
                                    " но ненадолго, потому что ему это быстро наскучат такие отношения\n" \
                                    "Если человек с числом 2 будет встречаться с человеком, число судьбы которого 1, будут гармоничные отношения только в том случае," \
                                    " если их роли четко распределены. Придется принять то, что за единицей останется последнее слово, но двойка, как великий манипулятор, " \
                                    "определит, каким это последнее слово будет."
                if int(summa_user5) == 3:
                    text_for_user = "Для людей с числом судьбы 3 идеальный партнер – это 5 или 7.\n" \
                                    "Смелая «пятерка», любящая приключения и яркие события, очень подходит для непредсказуемости и хаоса" \
                                    " тройки. Тихий интроверт 7, любящий мистику и загадочность, добавит глубину и осознанность отношениям." \
                                    " Это та совместимость, когда партнеры будут не только хорошо ладить, но и дополнять и понимать друг друга.\n" \
                                    "Людям  с числом судьбы 3 стоит избегать практичную «четверку». Такая пара будет видеть друг в друге только " \
                                    "плохие качества. Тройка может заинтересоваться привлекательной и властной «восьмеркой», но, в конце концов, " \
                                    "не сможет справиться с критикой в свой адрес и отношениям быстро придет конец."
                if int(summa_user5) == 4:
                    text_for_user = "Четверка нуждаются в крепких длительных отношениях, как никто другой. Это все потому, что они натура" \
                                    " практичная и устойчивая. Спокойно относится к быту и рутине в отношениях. Именно поэтому им не подойдет " \
                                    "непредсказуемая «тройка» и динамичная неутомимая «пятерка». Стоит также избегать мечтателя-идеалиста с " \
                                    "числом 9, так как «четверку» будет раздражать его легкомысленность, потому что они натура практичная и " \
                                    "приземленная. Зато отлично подойдет серьезная, сфокусированная на важном «единица» и целеустремленная «восьмерка». " \
                                    "А если «четверка» сойдется с заботливой, доброй «шестеркой», у них точно будет крепкая многодетная семья. " \
                                    "В этой паре удастся построить счастливое семейное будущее. Очень динамичные и сбалансированные отношения " \
                                    "«четверку» ждут с «семеркой». Она добавит приземленной натуре духовность, мечтательность и некую загадку."
                if int(summa_user5) == 5:
                    text_for_user = "«Пятерка»– тот человек, которому нужно разнообразие и перемены, поэтому им нужно избегать предсказуемых людей," \
                                    " с которыми им будет просто скучно. Отлично подойдет смелая, авторитетная «единица» и оптимистичная веселая «тройка»." \
                                    " С «семеркой» будут просто идеальные отношения. Динамичная, нетерпеливая «пятерка» и молчаливая загадочная «семерка» " \
                                    "будут балансировать друг друга.\n" \
                                    "4, 8 и 9 – нежелательные партнеры для в«пятерки». С 4 вам будет скучно, чрезмерная ответственность " \
                                    "9 будет раздражать, а целеустремленная 8 будет раздражать своими бесконечными планами и целями."
                if int(summa_user5) == 6:
                    text_for_user = "Людям  с числом судьбы 6  повезло, все черты характера идеально подойдут для любого другого числа судьбы." \
                                    " Они могут с легкостью построить длительные, крепкие отношения. Умеют чем-то жертвовать ради любви," \
                                    " подстраиваться под нужды партнера, они – заботливая и любящая натура. Если они будут встречаться с" \
                                    " двойкой, которая является эмоциональной нежной натурой, их ждут просто идеальные отношения. Они будут " \
                                    "любить и радовать друг друга постоянно. С остальными числами они также построят гармоничные отношения " \
                                    "благодаря любви, ласке и заботе."
                if int(summa_user5) == 7:
                    text_for_user = "У «семерок» очень завышенные ожидания, из-за этого им может быть сложно выбрать подходящего партнера." \
                                    " «Единица» и «восьмерка» будут доминировать. «Двойка» слишком эмоциональна и чувствительна, а «девятка» " \
                                    "уж слишком любит уединение. Тем не менее, «семерки» не зациклены на любви и отношениях, они умеют радоваться " \
                                    "жизни и без партнера, им комфортно и хорошо. Им будет интересно с тем партнером, который просто поразит их" \
                                    " своим интеллектом и чувством юмора, и будет понимать, что им нужно личное пространство, когда они хотят побыть " \
                                    "наедине с собой.  Самым подходящим партнером для «семерок» может стать 3 или 5. Креативная и светлая «тройка»," \
                                    " так же, как и интеллигентная непредсказуемая «пятерка» будут всегда мотивировать. А «семеркам» именно это и нужно в отношениях."
                if int(summa_user5) == 8:
                    text_for_user = "«Восьмеркам» важно, чтобы все было под их контролем, в том числе и отношения. Они привыкли быть лидером и " \
                                    "авторитетом. Они не умеют искать компромиссы, из-за этого часто возникают проблемы в личной жизни." \
                                    " Им подойдет мягкая и нежная «двойка», так же, как любящая и жертвующая «шестерка».\n" \
                                    "Независимая сильная «единица» – неподходящий «восьмеркам» партнер, они будут соревноваться за лидерство в" \
                                    " отношениях, их ждут постоянные споры и конфликты. Свободолюбивая 5 также не подходит, «восьмерка» будете " \
                                    "ее ограничивать, и в итоге потеряет.\n" \
                                    "Лучший вариант – это «четверка». Они оба достаточно приземленные практичные натуры, дисциплинированные и " \
                                    "целеустремленные личности, которые руководствуются логикой. У них очень много общего, их ждет успех не только" \
                                    " в личной жизни, но и в бизнесе, так что смело можно открывать семейное дело!\n"
                if int(summa_user5) == 9:
                    text_for_user = "«Девятки»– самая загадочная и сложная натура из всех вышеперечисленных. Они – натура довольно скрытная," \
                                    " любит быть в одиночестве, избегает много говорить о своих чувствах и переживаниях. Они сходятся с теми" \
                                    " людьми, которые уважают их личное пространство и всегда точно знают, когда они хотят побыть в одиночестве.\n" \
                                    "«Девяткам» очень подойдет чувствительная «двойка» и любящая «шестерка». Удивительно, но тройка им тоже близка, " \
                                    "они оба креативные и артистичные натуры, у них богатое воображение, необычное чувство юмора. Им точно будет, " \
                                    "о чем поговорить друг с другом."
                if int(summa_recipient5) == 1:
                    text_for_recipient = "Люди с числом 1 привыкли быть лидером во всех отношениях,  считают, что их мнение – самое " \
                                         "верное и решения, которые они принимают – самые правильные. Это может негативно отразиться на" \
                                         " отношениях. Все должно быть, как они хотят, не принимают точку зрения другого партнера. Их идеальный " \
                                         "партнер с числом судьбы 3 или 5. Это те люди, которые применяют правильный подход к такой властной натуре," \
                                         " как вы. Партнер с числом судьбы 3 – простая и беззаботная натура. Он не любит ничего решать, поэтому будет " \
                                         "только рад, если все важные решения принимать будут не они. А человек с числом судьбы 5 – очень гибкая натура." \
                                         " Он умеет находить компромиссы, добавляет некую динамичность и позитивную энергию в отношения, и серьезная «единица», " \
                                         "попадая под его чары, становится беззаботнее и веселее. Также Людям с числом 1 подойдет партнер с числом судьбы 6." \
                                         " Но он подходит всем числам судьбы, потому что это самая гармоничная натура, которая привнесет в любые отношения доброту, уют и счастье.\n" \
                                         "Людям с числом 1 не стоит встречаться с «восьмерками» и другими «единицами». Оба числа любят авторитет, поэтому их ожидают частые споры и " \
                                         "конфликты на тему «кто главный», ибо двух капитанов на одном корабле быть не может."
                if int(summa_recipient5) == 2:
                    text_for_recipient = "Человек с числом 2— очень хрупкая эмоциональная натура, которая тем не менее использует искусные манипуляции в отношениях." \
                                         " Самые гармоничные отношения ожидаются с человеком, число судьбы которого 8 или 9. Решительная и авторитетная «восьмерка» " \
                                         "отлично сойдется с мягким характером «двойки». Партнер с числом судьбы 9 – это любящий защитник.Человеку с числом 2 подойдет" \
                                         " именно такой человек.\n" \
                                         "Приземленная и эмоционально-зависимая «четверка» или серьезный интроверт «семерка» могут стать Человеку с числом 2 хорошей парой," \
                                         " но ненадолго, потому что ему это быстро наскучат такие отношения\n" \
                                         "Если человек с числом 2 будет встречаться с человеком, число судьбы которого 1, будут гармоничные отношения только в том случае," \
                                         " если их роли четко распределены. Придется принять то, что за единицей останется последнее слово, но двойка, как великий манипулятор, " \
                                         "определит, каким это последнее слово будет."
                if int(summa_recipient5) == 3:
                    text_for_recipient = "Для людей с числом судьбы 3 идеальный партнер – это 5 или 7.\n" \
                                         "Смелая «пятерка», любящая приключения и яркие события, очень подходит для непредсказуемости и хаоса" \
                                         " тройки. Тихий интроверт 7, любящий мистику и загадочность, добавит глубину и осознанность отношениям." \
                                         " Это та совместимость, когда партнеры будут не только хорошо ладить, но и дополнять и понимать друг друга.\n" \
                                         "Людям  с числом судьбы 3 стоит избегать практичную «четверку». Такая пара будет видеть друг в друге только " \
                                         "плохие качества. Тройка может заинтересоваться привлекательной и властной «восьмеркой», но, в конце концов, " \
                                         "не сможет справиться с критикой в свой адрес и отношениям быстро придет конец."
                if int(summa_recipient5) == 4:
                    text_for_recipient = "Четверка нуждаются в крепких длительных отношениях, как никто другой. Это все потому, что они натура" \
                                         " практичная и устойчивая. Спокойно относится к быту и рутине в отношениях. Именно поэтому им не подойдет " \
                                         "непредсказуемая «тройка» и динамичная неутомимая «пятерка». Стоит также избегать мечтателя-идеалиста с " \
                                         "числом 9, так как «четверку» будет раздражать его легкомысленность, потому что они натура практичная и " \
                                         "приземленная. Зато отлично подойдет серьезная, сфокусированная на важном «единица» и целеустремленная «восьмерка». " \
                                         "А если «четверка» сойдется с заботливой, доброй «шестеркой», у них точно будет крепкая многодетная семья. " \
                                         "В этой паре удастся построить счастливое семейное будущее. Очень динамичные и сбалансированные отношения " \
                                         "«четверку» ждут с «семеркой». Она добавит приземленной натуре духовность, мечтательность и некую загадку."
                if int(summa_recipient5) == 5:
                    text_for_recipient = "«Пятерка»– тот человек, которому нужно разнообразие и перемены, поэтому им нужно избегать предсказуемых людей," \
                                         " с которыми им будет просто скучно. Отлично подойдет смелая, авторитетная «единица» и оптимистичная веселая «тройка»." \
                                         " С «семеркой» будут просто идеальные отношения. Динамичная, нетерпеливая «пятерка» и молчаливая загадочная «семерка» " \
                                         "будут балансировать друг друга.\n" \
                                         "4, 8 и 9 – нежелательные партнеры для в«пятерки». С 4 вам будет скучно, чрезмерная ответственность " \
                                         "9 будет раздражать, а целеустремленная 8 будет раздражать своими бесконечными планами и целями."
                if int(summa_recipient5) == 6:
                    text_for_recipient = "Людям  с числом судьбы 6  повезло, все черты характера идеально подойдут для любого другого числа судьбы." \
                                         " Они могут с легкостью построить длительные, крепкие отношения. Умеют чем-то жертвовать ради любви," \
                                         " подстраиваться под нужды партнера, они – заботливая и любящая натура. Если они будут встречаться с" \
                                         " двойкой, которая является эмоциональной нежной натурой, их ждут просто идеальные отношения. Они будут " \
                                         "любить и радовать друг друга постоянно. С остальными числами они также построят гармоничные отношения " \
                                         "благодаря любви, ласке и заботе."
                if int(summa_recipient5) == 7:
                    text_for_recipient = "У «семерок» очень завышенные ожидания, из-за этого им может быть сложно выбрать подходящего партнера." \
                                         " «Единица» и «восьмерка» будут доминировать. «Двойка» слишком эмоциональна и чувствительна, а «девятка» " \
                                         "уж слишком любит уединение. Тем не менее, «семерки» не зациклены на любви и отношениях, они умеют радоваться " \
                                         "жизни и без партнера, им комфортно и хорошо. Им будет интересно с тем партнером, который просто поразит их" \
                                         " своим интеллектом и чувством юмора, и будет понимать, что им нужно личное пространство, когда они хотят побыть " \
                                         "наедине с собой.  Самым подходящим партнером для «семерок» может стать 3 или 5. Креативная и светлая «тройка»," \
                                         " так же, как и интеллигентная непредсказуемая «пятерка» будут всегда мотивировать. А «семеркам» именно это и нужно в отношениях."
                if int(summa_recipient5) == 8:
                    text_for_recipient = "«Восьмеркам» важно, чтобы все было под их контролем, в том числе и отношения. Они привыкли быть лидером и " \
                                         "авторитетом. Они не умеют искать компромиссы, из-за этого часто возникают проблемы в личной жизни." \
                                         " Им подойдет мягкая и нежная «двойка», так же, как любящая и жертвующая «шестерка».\n" \
                                         "Независимая сильная «единица» – неподходящий «восьмеркам» партнер, они будут соревноваться за лидерство в" \
                                         " отношениях, их ждут постоянные споры и конфликты. Свободолюбивая 5 также не подходит, «восьмерка» будете " \
                                         "ее ограничивать, и в итоге потеряет.\n" \
                                         "Лучший вариант – это «четверка». Они оба достаточно приземленные практичные натуры, дисциплинированные и " \
                                         "целеустремленные личности, которые руководствуются логикой. У них очень много общего, их ждет успех не только" \
                                         " в личной жизни, но и в бизнесе, так что смело можно открывать семейное дело!\n"
                if int(summa_recipient5) == 9:
                    text_for_recipient = "«Девятки»– самая загадочная и сложная натура из всех вышеперечисленных. Они – натура довольно скрытная," \
                                         " любит быть в одиночестве, избегает много говорить о своих чувствах и переживаниях. Они сходятся с теми" \
                                         " людьми, которые уважают их личное пространство и всегда точно знают, когда они хотят побыть в одиночестве.\n" \
                                         "«Девяткам» очень подойдет чувствительная «двойка» и любящая «шестерка». Удивительно, но тройка им тоже близка, " \
                                         "они оба креативные и артистичные натуры, у них богатое воображение, необычное чувство юмора. Им точно будет, " \
                                         "о чем поговорить друг с другом."
                telegraph.create_account(short_name='совместимость')
                response = telegraph.create_page(
                    f'Совместимость по дате рождения {user.birthday.replace(" ", ".")} и {date_copy}',
                    html_content=f'<b>📅Ваша дата: {user.birthday.replace(" ", ".")}</b><br>'
                                 f'<b>📅Дата партнера: {date_copy}</b><br>'
                                 f'<br>'
                                 f'🔮<b>Общее число судьбы: {summa5}</b><br>'
                                 f'{text}<br>'
                                 f'<br>'
                                 f'🔮<b>Ваше число судьбы: {summa_user5}</b><br>'
                                 f'{text_for_user}<br>'
                                 f'<br>'
                                 f'🔮<b>Число судьбы партнера: {summa_recipient5}</b><br>'
                                 f'{text_for_recipient}'
                )
                print(response)
                link = 'http://telegra.ph/{}'.format(response['path'])
                msg_text = hlink(" ", link)
                await message.answer(f"Результат{msg_text}расчета:", reply_markup=back_compatibility_ru)
            if user.language == "en":
                date = message.text
                date_copy = date
                date_split = date.split()
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 1) or (
                        int(date_split[0]) <= 19 and int(date_split[1]) == 2):
                    recipient_zodiac = "Aquarius"
                if (int(date_split[0]) >= 20 and int(date_split[1]) == 2) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 3):
                    recipient_zodiac = "Pisces"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 3) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 4):
                    recipient_zodiac = "Aries"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 4) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 5):
                    recipient_zodiac = "Taurus"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 5) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 6):
                    recipient_zodiac = "Gemini"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 6) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 7):
                    recipient_zodiac = "Cancer"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 7) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 8):
                    recipient_zodiac = "Leo"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 8) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 9):
                    recipient_zodiac = "Virgo"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 9) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 10):
                    recipient_zodiac = "Libra"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 10) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 11):
                    recipient_zodiac = "Scorpio"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 11) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 12):
                    recipient_zodiac = "Sagittarius"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 12) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 1):
                    recipient_zodiac = "Capricorn"
                user_zodiac = user.zodiac
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                date = date.replace(" ", "")
                summa = 0
                summa1 = 0
                summa2 = 0
                summa3 = 0
                summa4 = 0
                summa5 = 0
                summa_user = 0
                summa_user1 = 0
                summa_user2 = 0
                summa_user3 = 0
                summa_user4 = 0
                summa_user5 = 0
                summa_recipient = 0
                summa_recipient1 = 0
                summa_recipient2 = 0
                summa_recipient3 = 0
                summa_recipient4 = 0
                summa_recipient5 = 0
                for i in user.birthday.replace(' ', ''):
                    summa_user += int(i)
                for i in str(summa_user):
                    summa_user1 += int(i)
                for i in str(summa_user1):
                    summa_user2 += int(i)
                for i in str(summa_user2):
                    summa_user3 += int(i)
                for i in str(summa_user3):
                    summa_user4 += int(i)
                for i in str(summa_user4):
                    summa_user5 += int(i)
                for i in date:
                    summa_recipient += int(i)
                for i in str(summa_recipient):
                    summa_recipient1 += int(i)
                for i in str(summa_recipient1):
                    summa_recipient2 += int(i)
                for i in str(summa_recipient2):
                    summa_recipient3 += int(i)
                for i in str(summa_recipient3):
                    summa_recipient4 += int(i)
                for i in str(summa_recipient4):
                    summa_recipient5 += int(i)
                for i in user.birthday.replace(' ', ''):
                    summa1 += int(i)
                for i in date:
                    summa1 += int(i)
                for i in str(summa1):
                    summa2 += int(i)
                for i in str(summa2):
                    summa3 += int(i)
                for i in str(summa3):
                    summa4 += int(i)
                for i in str(summa4):
                    summa5 += int(i)
                if summa5 == 1:
                    text = f"The main thing for such an alliance is to act together. Here the inner potential of each other is revealed." \
                           f"Such a relationship helps overall development. We must not forget that one is the leader's number, so they can" \
                           f"there may be misunderstandings due to the division of power in a relationship. Quarrels and a showdown may occur," \
                           f"therefore, one of the partners just needs to learn to obey the other, then family life," \
                           f"and business will be more harmonious."
                if summa5 == 2:
                    text = "Such a couple is kept on a material basis. People really like to communicate with each other, but they are in" \
                           "This is mainly done for profit, because together they are lucky. It cannot be denied that over time" \
                           "you can get a family with good income. Here, too, everything will be stable. But even if you just lead" \
                           "business, your company will flourish. It must be remembered that two is an earthly number, so it is not" \
                           "vivid feelings are characteristic. There may even appear conflicts over money. Such a union does not like change and romance."
                if summa5 == 3:
                    text = "The main components of this union are the ability to communicate and be fickle. It will not be boring here. I would like to" \
                           "to note that friendly relations would be more appropriate in this case, since in a family with this figure there is" \
                           "coldness. Promises are made to each other and not kept. There can be betrayals on both sides. This is perhaps" \
                           "The hardest number to be compatible."
                if summa5 == 4:
                    text = "Organization, regularity, consistency, comfort are the components of this union. The family will be" \
                           "radiate warmth and well-being. Warmth in relationships makes them sincere. Excessive energy can" \
                           "interfere with the business life of the couple. The main thing here is spiritual enrichment, getting new impressions," \
                           "but the inability to increase capital."
                if summa5 == 5:
                    text = "One of the sexiest unions, where passions run high. Partners give each other many pleasant things" \
                           "moments. Everything is based only on love. But this is a couple of egoists. We must learn not only to listen, but also" \
                           "to hear each other, then everything will be fine and happy children will appear in the family. Excess energy can" \
                           "be targeted at any industry in the business and be quite successful."
                if summa5 == 6:
                    text = "Mutual assistance and partnership are the main links of this couple. This is also an earthly number, therefore relations" \
                           "are long-term. For doing business, just an ideal option. In the family - calmness, friendship, very" \
                           "rarely - a showdown. Feelings can fade away, but support for each other will remain."
                if summa5 == 7:
                    text = "The basis of this union is harmony. Partners know how to negotiate. It is impossible not to notice that here they can" \
                           "forget about the fulfillment of contractual obligations. Although scandals are practically not observed, it helps" \
                           "a sense of tact that does not lead to a break in relations. Such alliances are quite successful. Jointly resolved" \
                           "all problems, both family and material."
                if summa5 == 8:
                    text = "There is some oddity in this pair, one might even say non-standard. People are drawn to" \
                           "to each other. One partner, thanks to this attraction, can push the other, thereby helping him" \
                           "to be realized in business. But here internal dissatisfaction may appear if the first one understands," \
                           "that he is used in something out of a sense of self-interest. If there is a quarrel, it can turn into" \
                           "a huge scandal. We must learn to raise self-esteem. In a couple, jealousy is possible. You must be" \
                           "flexible in this union, then everything will work out."
                if summa5 == 9:
                    text = "The most philosophical couple. If in material terms everything is going well here, we have an ideal one" \
                           "couple. Well, with a weak financial situation, relations are cracking. Therefore, it is better to be friends here, and not" \
                           "to create a family union, since everyday life can absorb both and separate them in different directions. If all the same" \
                           "Marriage is the case, make sure one of the partners must take on the many problems of everyday life." \
                           "Then the union will be harmonious."
                if int(summa_user5) == 1:
                    text_for_user = "Number 1 people are accustomed to being a leader in all respects, they think that their opinion is the most" \
                                    "what is right and the decisions they make are the right ones. This can negatively affect" \
                                    "relationship. Everything should be as they want, do not take the point of view of the other partner. Their ideal" \
                                    "partner with a destiny number of 3 or 5. These are the people who take the right approach to such a domineering nature," \
                                    "like you. A partner with a destiny number of 3 is a simple and carefree nature. He does not like to decide anything, so he will" \
                                    "I am only glad if all the important decisions are not made by them. And a person with a fate number of 5 is a very flexible nature." \
                                    "He knows how to find compromises, adds some dynamism and positive energy to relationships, and a serious unit," \
                                    "falling under his spell, it becomes more carefree and more fun. Also, people with the number 1 will suit a partner with the number of destiny 6." \
                                    "But he suits all numbers of fate, because he is the most harmonious nature, which will bring kindness, comfort and happiness to any relationship. \n " \
                                    "People with the number 1 should not meet with eights and other ones. Both numbers love authority, so frequent controversy awaits them and" \
                                    "conflicts over who is in charge, because there can be no two captains on one ship."
                if int(summa_user5) == 2:
                    text_for_user = "The number 2 person is a very fragile emotional person who nevertheless uses skillful manipulation in relationships." \
                                    "The most harmonious relationship is expected with a person whose fate is 8 or 9. A resolute and authoritative eight" \
                                    "Excellent get away with a gentle nature with a number of partner of two fates 9 -. a loving zaschitnik.Cheloveku with the number 2 will approach" \
                                    "such a person. \n " \
                                    "A down-to-earth and emotionally dependent four or a serious introvert seven can be a good pair for a Number 2 Person," \
                                    "but not for long, because he will quickly get bored with such a relationship \n " \
                                    "If a person with the number 2 meets a person whose fate number is 1, there will be harmonious relations only if" \
                                    "if their roles are clearly assigned. We'll have to accept that the unit will have the last word, but the deuce, as a great manipulator," \
                                    "will determine what this last word will be."
                if int(summa_user5) == 3:
                    text_for_user = "For people with a destiny number of 3, the ideal partner is 5 or 7. \n " \
                                    "A brave five, loving adventure and bright events, very suitable for unpredictability and chaos" \
                                    "threes. The quiet introvert 7, who loves mysticism and mystery, will add depth and awareness to relationships." \
                                    "This is the kind of compatibility when partners will not only get along well, but also complement and understand each other. \n " \
                                    "People with a fate number of 3 should avoid the practical four. Such a couple will only see in each other" \
                                    "bad qualities. A three may become interested in an attractive and powerful eight, but in the end," \
                                    "will not be able to cope with criticism and the relationship will end quickly."
                if int(summa_user5) == 4:
                    text_for_user = " Fours need strong long-term relationships like no other. It's all because they are nature." \
                                    "practical and stable. Calm about everyday life and routine in a relationship. That is why it will not suit them" \
                                    "an unpredictable three and a dynamic indefatigable five. You should also avoid the idealistic dreamer with" \
                                    "the number 9, since the four will annoy his frivolity, because they are practical nature and" \
                                    "down to earth. But the perfect is a serious, focused on the importance of unity and purposeful eight." \
                                    "And if you get away with four caring, good six, they will definitely be a strong family with many children." \
                                    "This couple will be able to build a happy family future. A very dynamic and balanced relationship" \
                                    "A four is expected with a seven. It will add spirituality, dreaminess and a kind of mystery to a down-to-earth nature."
                if int(summa_user5) == 5:
                    text_for_user = "Five is the kind of person who needs variety and change, so they need to avoid predictable people," \
                                    "They'll just get bored with them. A bold, authoritative unit and an upbeat, fun trio are perfect." \
                                    "There will be just ideal relations with the seven. A dynamic, impatient five and a silent mysterious seven" \
                                    "will balance each other. \n " \
                                    "4, 8 and 9 are undesirable partners for the five. With 4 you will be bored, excessive responsibility" \
                                    "9 will be annoying, and purposeful 8 will be annoying with her endless plans and goals."
                if int(summa_user5) == 6:
                    text_for_user = "People with a Destiny Number 6 are lucky, all traits are perfect for any other Destiny Number." \
                                    "They can easily build long-term, strong relationships. They know how to sacrifice something for love," \
                                    "to adapt to the needs of their partner, they are caring and loving. If they date" \
                                    "a deuce, which is an emotional tender nature, they are just waiting for a perfect relationship. They will" \
                                    "to love and delight each other constantly. With the rest of the numbers, they will also build a harmonious relationship" \
                                    "thanks to love, affection and care."
                if int(summa_user5) == 7:
                    text_for_user = "Sevens have very high expectations, which can make it difficult for them to choose the right partner." \
                                    "One and eight will dominate. Two is too emotional and sensitive, and nine" \
                                    "he loves solitude too much. Nevertheless, sevens are not fixated on love and relationships, they know how to rejoice" \
                                    "life and without a partner, they feel comfortable and well. They will be interesting with the partner that will simply amaze them" \
                                    "with their intelligence and sense of humor, and will understand that they need personal space when they want to be" \
                                    "alone with yourself. The most suitable partner for sevens can be 3 or 5. Creative and light three," \
                                    "just like the intelligent unpredictable five will always motivate. And the sevens are exactly what they need in a relationship."
                if int(summa_user5) == 8:
                    text_for_user = "It is important for the Eight that everything is under their control, including the relationship. They are used to being a leader and" \
                                    "authority. They do not know how to seek compromises, because of this, problems often arise in their personal lives." \
                                    "A soft and gentle deuce will suit them, as well as a loving and sacrificial six. \n " \
                                    "An independent strong unit is not a suitable partner for the eights, they will compete for leadership in" \
                                    "relations, they will face constant disputes and conflicts. Freedom-loving 5 is also not suitable, the eight will be" \
                                    "limit it, and eventually lose it. \n " \
                                    "The best option is a four. They are both quite down-to-earth practical natures, disciplined and" \
                                    "purposeful individuals who are guided by logic. They have a lot in common, they will be successful not only" \
                                    "in personal life, but also in business, so you can safely start a family business! \n "
                if int(summa_user5) == 9:
                    text_for_user = "Nines are the most mysterious and complex nature of all of the above. They are a rather secretive nature," \
                                    "he likes to be alone, avoids talking a lot about his feelings and experiences. They agree with those" \
                                    "people who respect their privacy and always know exactly when they want to be alone. \n " \
                                    "A sensitive two and a loving six are very suitable for nines. Surprisingly, the three are also close to them," \
                                    "They are both creative and artistic, they have a rich imagination, an unusual sense of humor. They will definitely be," \
                                    "what to talk about with each other."
                if int(summa_recipient5) == 1:
                    text_for_recipient = "Number 1 people are accustomed to being a leader in all respects, they think that their opinion is the most" \
                                         "what is right and the decisions they make are the right ones. This can negatively affect" \
                                         "relationship. Everything should be as they want, do not take the point of view of the other partner. Their ideal" \
                                         "partner with a destiny number of 3 or 5. These are the people who take the right approach to such a domineering nature," \
                                         "like you. A partner with a destiny number of 3 is a simple and carefree nature. He does not like to decide anything, so he will" \
                                         "I am only glad if all the important decisions are not made by them. And a person with a fate number of 5 is a very flexible nature." \
                                         "He knows how to find compromises, adds some dynamism and positive energy to relationships, and a serious unit," \
                                         "falling under his spell, it becomes more carefree and more fun. Also, people with the number 1 will suit a partner with the number of destiny 6." \
                                         "But he suits all numbers of fate, because he is the most harmonious nature, which will bring kindness, comfort and happiness to any relationship. \n " \
                                         "People with the number 1 should not meet with eights and other ones. Both numbers love authority, so frequent controversy awaits them and" \
                                         "conflicts over who is in charge, because there can be no two captains on one ship."
                if int(summa_recipient5) == 2:
                    text_for_recipient = "Number 2 person is a very fragile emotional person who nevertheless uses skillful manipulation in relationships." \
                                         "The most harmonious relationship is expected with a person whose fate is 8 or 9. A resolute and authoritative eight" \
                                         "Excellent get away with a gentle nature with a number of partner of two fates 9 -. a loving zaschitnik.Cheloveku with the number 2 will approach" \
                                         "such a person. \n " \
                                         "A down-to-earth and emotionally dependent four or a serious introvert seven can be a good pair for a Number 2 Person," \
                                         "but not for long, because he will quickly get bored with such a relationship \n " \
                                         "If a person with the number 2 meets a person whose fate number is 1, there will be harmonious relations only if" \
                                         "if their roles are clearly assigned. We'll have to accept that the unit will have the last word, but the deuce, as a great manipulator," \
                                         "will determine what this last word will be."
                if int(summa_recipient5) == 3:
                    text_for_recipient = "For people with a destiny number of 3, the ideal partner is 5 or 7. \n " \
                                         "A brave five, loving adventure and bright events, very suitable for unpredictability and chaos" \
                                         "threes. The quiet introvert 7, who loves mysticism and mystery, will add depth and awareness to relationships." \
                                         "This is the kind of compatibility when partners will not only get along well, but also complement and understand each other. \n " \
                                         "People with a fate number of 3 should avoid the practical four. Such a couple will only see in each other" \
                                         "bad qualities. A three may become interested in an attractive and powerful eight, but in the end," \
                                         "will not be able to cope with criticism and the relationship will end quickly."
                if int(summa_recipient5) == 4:
                    text_for_recipient = " Fours need strong long-term relationships like no other. It's all because they are by nature." \
                                         "practical and stable. Calm about everyday life and routine in a relationship. That is why it will not suit them" \
                                         "an unpredictable three and a dynamic indefatigable five. You should also avoid the idealistic dreamer with" \
                                         "the number 9, since the four will annoy his frivolity, because they are practical nature and" \
                                         "down to earth. But the perfect is a serious, focused on the importance of unity and purposeful eight." \
                                         "And if you get away with four caring, good six, they will definitely be a strong family with many children." \
                                         "This couple will be able to build a happy family future. A very dynamic and balanced relationship" \
                                         "A four is expected with a seven. It will add spirituality, dreaminess and a kind of mystery to a down-to-earth nature."
                if int(summa_recipient5) == 5:
                    text_for_recipient = "A 5 is the kind of person who needs variety and change, so they need to avoid predictable people," \
                                         "They'll just get bored with them. A bold, authoritative unit and an upbeat, fun trio are perfect." \
                                         "There will be just ideal relations with the seven. A dynamic, impatient five and a silent mysterious seven" \
                                         "will balance each other. \n " \
                                         "4, 8 and 9 are undesirable partners for the five. With 4 you will be bored, excessive responsibility" \
                                         "9 will be annoying, and purposeful 8 will be annoying with her endless plans and goals."
                if int(summa_recipient5) == 6:
                    text_for_recipient = "People with a Destiny Number 6 are lucky, all traits are perfect for any other Destiny Number." \
                                         "They can easily build long-term, strong relationships. They know how to sacrifice something for love," \
                                         "to adapt to the needs of their partner, they are caring and loving. If they date" \
                                         "a deuce, which is an emotional tender nature, they are just waiting for a perfect relationship. They will" \
                                         "to love and delight each other constantly. With the rest of the numbers, they will also build a harmonious relationship" \
                                         "thanks to love, affection and care."
                if int(summa_recipient5) == 7:
                    text_for_recipient = "Sevens have very high expectations, which can make it difficult for them to choose the right partner." \
                                         "One and eight will dominate. Two is too emotional and sensitive, and nine" \
                                         "he loves solitude too much. Nevertheless, sevens are not fixated on love and relationships, they know how to rejoice" \
                                         "life and without a partner, they feel comfortable and well. They will be interesting with the partner that will simply amaze them" \
                                         "with their intelligence and sense of humor, and will understand that they need personal space when they want to be" \
                                         "alone with yourself. The most suitable partner for sevens can be 3 or 5. Creative and light three," \
                                         "just like the intelligent unpredictable five will always motivate. And the sevens are exactly what they need in a relationship."
                if int(summa_recipient5) == 8:
                    text_for_recipient = "It is important for the Eight that everything is under their control, including the relationship. They are used to being a leader and" \
                                         "authority. They do not know how to seek compromises, because of this, problems often arise in their personal lives." \
                                         "A soft and gentle deuce will suit them, as well as a loving and sacrificial six. \n " \
                                         "An independent strong unit is not a suitable partner for the eights, they will compete for leadership in" \
                                         "relations, they will face constant disputes and conflicts. Freedom-loving 5 is also not suitable, the eight will be" \
                                         "limit it, and eventually lose it. \n " \
                                         "The best option is a four. They are both quite down-to-earth practical natures, disciplined and" \
                                         "purposeful individuals who are guided by logic. They have a lot in common, they will be successful not only" \
                                         "in personal life, but also in business, so you can safely start a family business! \n "
                if int(summa_recipient5) == 9:
                    text_for_recipient = "Nines are the most mysterious and complex nature of all of the above. They are a rather secretive nature," \
                                         "he likes to be alone, avoids talking a lot about his feelings and experiences. They agree with those" \
                                         "people who respect their privacy and always know exactly when they want to be alone. \n " \
                                         "A sensitive two and a loving six are very suitable for nines. Surprisingly, the three are also close to them," \
                                         "They are both creative and artistic, they have a rich imagination, an unusual sense of humor. They will definitely be," \
                                         "what to talk about with each other."
                telegraph.create_account(short_name='совместимость')
                response = telegraph.create_page(
                    f'Date of birth compatibility {user.birthday.replace(" ", ".")} and {date_copy}',
                    html_content=f'<b>📅Your date: {user.birthday.replace(" ", ".")}</b><br>'
                                 f'<b>📅Partner date: {date_copy}</b><br>'
                                 f'<br>'
                                 f'🔮<b>Total Destiny: {summa5}</b><br>'
                                 f'{text}<br>'
                                 f'<br>'
                                 f'🔮<b>Your Destiny Number: {summa_user5}</b><br>'
                                 f'{text_for_user}<br>'
                                 f'<br>'
                                 f'🔮<b>Number of partner`s destiny: {summa_recipient5}</b><br>'
                                 f'{text_for_recipient}'
                )
                print(response)
                link = 'http://telegra.ph/{}'.format(response['path'])
                msg_text = hlink(" ", link)
                await message.answer(f"Calculation{msg_text}result:", reply_markup=back_compatibility_en)
            if user.language == "es":
                date = message.text
                date_copy = date
                date_split = date.split()
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 1) or (
                        int(date_split[0]) <= 19 and int(date_split[1]) == 2):
                    recipient_zodiac = "Aquarius"
                if (int(date_split[0]) >= 20 and int(date_split[1]) == 2) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 3):
                    recipient_zodiac = "Pisces"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 3) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 4):
                    recipient_zodiac = "Aries"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 4) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 5):
                    recipient_zodiac = "Taurus"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 5) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 6):
                    recipient_zodiac = "Gemini"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 6) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 7):
                    recipient_zodiac = "Cancer"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 7) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 8):
                    recipient_zodiac = "Leo"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 8) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 9):
                    recipient_zodiac = "Virgo"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 9) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 10):
                    recipient_zodiac = "Libra"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 10) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 11):
                    recipient_zodiac = "Scorpio"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 11) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 12):
                    recipient_zodiac = "Sagittarius"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 12) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 1):
                    recipient_zodiac = "Capricorn"
                user_zodiac = user.zodiac
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                date = date.replace(" ", "")
                summa = 0
                summa1 = 0
                summa2 = 0
                summa3 = 0
                summa4 = 0
                summa5 = 0
                summa_user = 0
                summa_user1 = 0
                summa_user2 = 0
                summa_user3 = 0
                summa_user4 = 0
                summa_user5 = 0
                summa_recipient = 0
                summa_recipient1 = 0
                summa_recipient2 = 0
                summa_recipient3 = 0
                summa_recipient4 = 0
                summa_recipient5 = 0
                for i in user.birthday.replace(' ', ''):
                    summa_user += int(i)
                for i in str(summa_user):
                    summa_user1 += int(i)
                for i in str(summa_user1):
                    summa_user2 += int(i)
                for i in str(summa_user2):
                    summa_user3 += int(i)
                for i in str(summa_user3):
                    summa_user4 += int(i)
                for i in str(summa_user4):
                    summa_user5 += int(i)
                for i in date:
                    summa_recipient += int(i)
                for i in str(summa_recipient):
                    summa_recipient1 += int(i)
                for i in str(summa_recipient1):
                    summa_recipient2 += int(i)
                for i in str(summa_recipient2):
                    summa_recipient3 += int(i)
                for i in str(summa_recipient3):
                    summa_recipient4 += int(i)
                for i in str(summa_recipient4):
                    summa_recipient5 += int(i)
                for i in user.birthday.replace(' ', ''):
                    summa1 += int(i)
                for i in date:
                    summa1 += int(i)
                for i in str(summa1):
                    summa2 += int(i)
                for i in str(summa2):
                    summa3 += int(i)
                for i in str(summa3):
                    summa4 += int(i)
                for i in str(summa4):
                    summa5 += int(i)
                if summa5 == 1:
                    text = "Lo principal para tal alianza es actuar juntos. Aquí se revela el potencial interno de cada uno." \
                           "Estas relaciones ayudan al desarrollo general. No debemos olvidar que uno es el número del líder, por lo que pueden" \
                           "Puede haber malentendidos debido a la división de poder en una relación. Pueden aparecer peleas y un enfrentamiento", \
                           "por lo tanto, uno de los socios solo necesita aprender a obedecer al otro, luego a la vida familiar", \
                           "y los negocios serán más armoniosos"
                if summa5 == 2:
                    text = "Esta pareja se mantiene sobre una base material. A la gente realmente le gusta comunicarse entre sí, pero están en" \
                           "Esto se hace principalmente con fines de lucro, porque juntos tienen suerte. No se puede negar que con el tiempo" \
                           "puedes tener una familia con buenos ingresos. Aquí también todo será estable. Pero incluso si solo lideras" \
                           "negocio, su empresa florecerá. Debe recordarse que dos es un número terrenal, por lo que no lo es" \
                           "Los sentimientos vívidos son característicos. Incluso pueden aparecer conflictos por el dinero. A esa unión no le gustan los cambios y el romance"
                if summa5 == 3:
                    text = "Los componentes principales de esta unión son la capacidad de comunicarse y ser voluble. No será aburrido aquí. Me gustaría" \
                           "señalar que las relaciones amistosas serían más adecuadas en este caso, ya que en una familia con esta figura hay" \
                           "Frialdad. Las promesas se hacen el uno al otro y no se cumplen. Puede haber traiciones en ambos lados. Esto es quizás" \
                           "El número más difícil de ser compatible"
                if summa5 == 4:
                    text = "Organización, regularidad, coherencia, comodidad son los componentes de esta unión. La familia será" \
                           "irradian calidez y bienestar. La calidez en las relaciones las hace sinceras. La energía excesiva puede" \
                           "Interferir con la vida empresarial de las parejas donde lo principal - es un enriquecimiento espiritual, obtener nuevas experiencias", \
                           "sino la imposibilidad de aumentar el capital"
                if summa5 == 5:
                    text = "Una de las uniones más sexys, donde las pasiones son altas. Las parejas se dan muchas cosas agradables" \
                           "Momentos. Todo se basa sólo en el amor. Pero esto es un par de egoístas. Debemos aprender no sólo a escuchar, sino también" \
                           "para escucharse, entonces todo estará bien y aparecerán niños felices en la familia. El exceso de energía puede" \
                           "Apuntar a cualquier industria del negocio y tener el éxito suficiente"
                if summa5 == 6:
                    text = "La asistencia mutua y la asociación son los principales vínculos de esta pareja. Este también es un número terrenal, por lo tanto, la relación" \
                           "son a largo plazo. Para hacer negocios, solo una opción ideal. En la familia - tranquilidad, amistad, muy" \
                           "Rara vez, un enfrentamiento. Los sentimientos pueden desvanecerse, pero el apoyo mutuo permanecerá"
                if summa5 == 7:
                    text = "La base de esta unión es la armonía. Los socios saben negociar. Es imposible no darse cuenta de que aquí pueden" \
                           "Olvídate del cumplimiento de las obligaciones contractuales. Aunque prácticamente no se observan escándalos, ayuda" \
                           "un sentido del tacto, que no conduce a una ruptura en las relaciones. Tales alianzas son bastante exitosas. Resueltas conjuntamente" \
                           "Todos los problemas, tanto familiares como materiales"
                if summa5 == 8:
                    text = "Hay alguna rareza en este par, incluso se podría decir que no es estándar. La gente se siente atraída por" \
                           "El uno al otro. Un socio, gracias a esta atracción, puede empujar al otro, ayudándolo así" \
                           "para realizarse en los negocios. Pero aquí puede aparecer la insatisfacción interna, si el primero comprende", \
                           "que se le utiliza en algo por interés propio. Si hay una disputa, puede convertirse en" \
                           "un gran escándalo. Debemos aprender a elevar la autoestima. En una pareja, los celos son posibles. Debes estar" \
                           "flexible en esta unión, entonces todo saldrá bien"
                if summa5 == 9:
                    text = "La pareja más filosófica. Si en términos materiales todo va bien aquí, tenemos una ideal" \
                           "pareja. Bueno, con una situación financiera débil, las relaciones se están rompiendo. Por lo tanto, es mejor ser amigos aquí, y no" \
                           "para crear una unión familiar, ya que la vida cotidiana puede absorber a ambos y disolverse en diferentes direcciones. Si, después de todo," \
                           "El matrimonio es el caso, asegúrese de que uno de los socios debe asumir los muchos problemas de la vida cotidiana." \
                           "Entonces la unión será armoniosa"
                if int(summa_user5) == 1:
                    text_for_user = "Las personas número 1 están acostumbradas a ser líderes en todos los aspectos, piensan que su opinión es la más" \
                                    "lo que es correcto y las decisiones que toman son las correctas. Esto puede afectar negativamente" \
                                    "Relación. Todo debe ser como ellos quieren, no adopten el punto de vista del otro socio. Su ideal" \
                                    "un socio con un número de destino de 3 o 5. Estas son las personas que adoptan el enfoque correcto para una naturaleza tan dominante", \
                                    "como tú. Un socio con un número de destino de 3 es una naturaleza simple y despreocupada. No le gusta decidir nada, así que lo hará" \
                                    "Solo me alegro si ellos no toman todas las decisiones importantes. Y una persona con un número de destino de 5 es de naturaleza muy flexible" \
                                    "Sabe cómo encontrar compromisos, agrega algo de dinamismo y energía positiva a las relaciones, y una unidad seria", \
                                    "caer bajo su hechizo, se vuelve más despreocupado y más divertido. Además, las personas con el número 1 se adaptarán a un compañero con el número de destino 6." \
                                    "Pero se adapta a todos los números del destino, porque es la naturaleza más armoniosa, lo que traerá bondad, comodidad y felicidad a cualquier relación. \n " \
                                    "Las personas con el número 1 no deberían encontrarse con ochos y otros. Ambos números aman la autoridad, por lo que esperan controversias frecuentes y" \
                                    "Conflictos sobre quién está a cargo, porque no puede haber dos capitanes en un barco"
                if int(summa_user5) == 2:
                    text_for_user = "La persona número 2 es una persona emocional muy frágil que, sin embargo, usa una hábil manipulación en las relaciones" \
                                    "Se espera la relación más armoniosa con una persona cuyo destino es 8 o 9. Un ocho resuelto y autoritario" \
                                    "irá bien con el carácter gentil de un 2. Un compañero con un número de destino 9 es un defensor amoroso. Una persona con un número 2 servirá" \
                                    "una persona así. \n " \
                                    "Un cuatro con los pies en la tierra y emocionalmente dependiente o un siete introvertido serio pueden ser una buena pareja para una Persona Número 2", \
                                    "pero no por mucho tiempo, porque rápidamente se aburrirá con esa relación \n " \
                                    "Si una persona con el número 2 se encuentra con una persona cuyo número de destino es 1, habrá relaciones armoniosas sólo si" \
                                    "if sus roles están claramente asignados. Tendremos que aceptar que la unidad tendrá la última palabra, pero el diablo, como gran manipulador," \
                                    "determinará cuál será esta última palabra"
                if int(summa_user5) == 3:
                    text_for_user = "Para las personas con un número de destino de 3, el compañero ideal es 5 o 7. \n " \
                                    "Cinco valientes, aventuras amorosas y eventos brillantes, muy adecuados para la imprevisibilidad y el caos" \
                                    "Tres. El tranquilo introvertido 7, que ama el misticismo y el misterio, agregará profundidad y conciencia a las relaciones" \
                                    "Este es el tipo de compatibilidad en la que los socios no solo se llevarán bien, sino que también se complementarán y se entenderán entre sí. \n " \
                                    "Las personas con un número de destino de 3 deberían evitar el práctico cuatro. Una pareja así solo se verá en el otro" \
                                    "malas cualidades. Un tres puede interesarse en un ocho atractivo y poderoso, pero al final," \
                                    "No será capaz de hacer frente a las críticas y la relación terminará rápidamente"
                if int(summa_user5) == 4:
                    text_for_user = "Los Cuatro necesitan relaciones sólidas y duraderas como ninguna otra. Es todo porque lo son por naturaleza" \
                                    "práctico y estable. Tranquilo sobre la vida cotidiana y la rutina en una relación. Por eso no les conviene" \
                                    "un tres impredecible y un cinco dinámico infatigable. También debes evitar al soñador idealista con" \
                                    "El número 9, ya que los cuatro molestarán su frivolidad, porque son de carácter práctico y" \
                                    "a la tierra. Pero el ideal es una enfermedad grave, se centró en la importancia de la unidad y con un propósito ocho." \
                                    "Y si te salgas con cuatro cuidado, buena seis, que definitivamente van a ser una familia fuerte con muchos niños." \
                                    "Esta pareja podrá construir un futuro familiar feliz. Una relación muy dinámica y equilibrada" \
                                    "Se espera un cuatro con un siete. Agregará espiritualidad, ensueño y una especie de misterio a una naturaleza realista"
                if int(summa_user5) == 5:
                    text_for_user = "Five es el tipo de persona que necesita variedad y cambio, por lo que deben evitar a las personas predecibles", \
                                    "Simplemente se aburrirán con ellos. Una unidad audaz y autoritaria y un trío alegre y divertido son perfectos" \
                                    "Sólo habrá una relación ideal con los siete. Los cinco dinámicos, impacientes y los misteriosos siete silenciosos" \
                                    "se equilibrarán entre sí. \n " \
                                    "4, 8 y 9 son socios indeseables para los cinco. Con 4 te aburrirás, excesiva responsabilidad" \
                                    "9 será molesto, y el decidido 8 será molesto con sus infinitos planes y metas"
                if int(summa_user5) == 6:
                    text_for_user = "Las personas con un número de destino 6 tienen suerte, todos los rasgos son perfectos para cualquier otro número de destino" \
                                    "Pueden construir fácilmente relaciones sólidas a largo plazo. Saben cómo sacrificar algo por amor", \
                                    "para adaptarse a las necesidades de su pareja, son cariñosos y cariñosos. Si salen" \
                                    "un diablo, que es una naturaleza tierna emocional, solo están esperando una relación perfecta. Lo harán" \
                                    "Amarnos y deleitarnos constantemente. Con el resto de los números, también construirán una relación armoniosa" \
                                    "gracias al cariño, cariño y cariño"
                if int(summa_user5) == 7:
                    text_for_user = "Los Siete tienen expectativas muy altas, lo que puede dificultarles la elección del socio adecuado" \
                                    "Uno y ocho dominarán. Dos es demasiado emocional y sensible, y nueve" \
                                    "ama demasiado la soledad. Sin embargo, los sietes no están obsesionados con el amor y las relaciones, saben cómo alegrarse" \
                                    "la vida y sin pareja, se sienten cómodos y bien. Serán interesantes con la pareja que simplemente los sorprenderá" \
                                    "con su inteligencia y sentido del humor, y comprenderán que necesitan un espacio personal cuando quieran estar" \
                                    "a solas contigo mismo. El compañero más adecuado para sietes puede ser 3 o 5. Creativo y ligero tres," \
                                    "al igual que un cinco inteligente e impredecible siempre motivará. Y siete son exactamente lo que necesitan en una relación"
                if int(summa_user5) == 8:
                    text_for_user = "Es importante para los Ocho que todo esté bajo su control, incluida la relación. Están acostumbrados a ser líderes y" \
                                    "Autoridad. No saben cómo buscar compromisos, por eso, a menudo surgen problemas en su vida personal" \
                                    "Un deuce suave y gentil les vendrá bien, así como un seis amoroso y sacrificado. \n " \
                                    "Una unidad fuerte independiente no es un socio adecuado para los ocho, competirán por el liderazgo en" \
                                    "Relaciones, están a la espera de constantes disputas y conflictos. Los amantes de la libertad 5 tampoco son adecuados, los ocho serán" \
                                    "limitarlo y eventualmente perderlo. \n " \
                                    "La mejor opción es un cuatro. Ambos tienen una naturaleza práctica bastante realista, disciplinada y" \
                                    "Individuos decididos que se guían por la lógica. Tienen mucho en común, no solo tendrán éxito" \
                                    "en la vida personal, pero también en los negocios, ¡para que pueda iniciar un negocio familiar de forma segura! \n "
                if int(summa_user5) == 9:
                    text_for_user = "Los nueves son la naturaleza más misteriosa y compleja de todas las anteriores. Son una naturaleza bastante reservada," \
                                    "Le gusta estar solo, evita hablar mucho de sus sentimientos y vivencias. Están de acuerdo con esos" \
                                    "personas que respetan su privacidad y siempre saben exactamente cuándo quieren estar solos. \n " \
                                    "Un dos sensible y un seis amoroso son muy adecuados para los nueves. Sorprendentemente, los tres también están cerca de ellos", \
                                    "Son tanto creativos como artísticos, tienen una imaginación rica, un sentido del humor inusual. Definitivamente lo serán", \
                                    "de qué hablar entre nosotros"
                if int(summa_recipient5) == 1:
                    text_for_recipient = "Las personas número 1 están acostumbradas a ser líderes en todos los aspectos, piensan que su opinión es la más" \
                                         "lo que es correcto y las decisiones que toman son las correctas. Esto puede afectar negativamente" \
                                         "Relación. Todo debe ser como ellos quieren, no adopten el punto de vista del otro socio. Su ideal" \
                                         "un socio con un número de destino de 3 o 5. Estas son las personas que adoptan el enfoque correcto para una naturaleza tan dominante", \
                                         "como tú. Un socio con un número de destino de 3 es una naturaleza simple y despreocupada. No le gusta decidir nada, así que lo hará" \
                                         "Solo me alegro si ellos no toman todas las decisiones importantes. Y una persona con un número de destino de 5 es de naturaleza muy flexible" \
                                         "Sabe cómo encontrar compromisos, agrega algo de dinamismo y energía positiva a las relaciones, y una unidad seria", \
                                         "caer bajo su hechizo, se vuelve más despreocupado y más divertido. Además, las personas con el número 1 se adaptarán a un compañero con el número de destino 6." \
                                         "Pero se adapta a todos los números del destino, porque es la naturaleza más armoniosa, lo que traerá bondad, comodidad y felicidad a cualquier relación. \n " \
                                         "Las personas con el número 1 no deberían encontrarse con ochos y otros. Ambos números aman la autoridad, por lo que esperan controversias frecuentes y" \
                                         "Conflictos sobre quién está a cargo, porque no puede haber dos capitanes en un barco"
                if int(summa_recipient5) == 2:
                    text_for_recipient = "La persona número 2 es una persona emocional muy frágil que, sin embargo, usa una hábil manipulación en las relaciones" \
                                         "Se espera la relación más armoniosa con una persona cuyo destino es 8 o 9. Un ocho resuelto y autoritario" \
                                         "irá bien con el carácter gentil de un 2. Un compañero con un número de destino 9 es un defensor amoroso. Una persona con un número 2 servirá" \
                                         "una persona así. \n " \
                                         "Un cuatro con los pies en la tierra y emocionalmente dependiente o un siete introvertido serio pueden ser una buena pareja para una Persona Número 2", \
                                         "pero no por mucho tiempo, porque rápidamente se aburrirá con esa relación \n " \
                                         "Si una persona con el número 2 se encuentra con una persona cuyo número de destino es 1, habrá relaciones armoniosas sólo si" \
                                         "if sus roles están claramente asignados. Tendremos que aceptar que la unidad tendrá la última palabra, pero el diablo, como gran manipulador," \
                                         "determinará cuál será esta última palabra"
                if int(summa_recipient5) == 3:
                    text_for_recipient = "Para las personas con un número de destino de 3, el compañero ideal es 5 o 7. \n " \
                                         "Cinco valientes, aventuras amorosas y eventos brillantes, muy adecuados para la imprevisibilidad y el caos" \
                                         "Tres. El tranquilo introvertido 7, que ama el misticismo y el misterio, agregará profundidad y conciencia a las relaciones" \
                                         "Este es el tipo de compatibilidad en la que los socios no solo se llevarán bien, sino que también se complementarán y se entenderán entre sí. \n " \
                                         "Las personas con un número de destino de 3 deberían evitar el práctico cuatro. Una pareja así solo se verá en el otro" \
                                         "malas cualidades. Un tres puede interesarse en un ocho atractivo y poderoso, pero al final," \
                                         "No será capaz de hacer frente a las críticas y la relación terminará rápidamente"
                if int(summa_recipient5) == 4:
                    text_for_recipient = "Los Cuatro necesitan relaciones sólidas a largo plazo como ninguna otra. Es todo porque lo son por naturaleza" \
                                         "práctico y estable. Tranquilo sobre la vida cotidiana y la rutina en una relación. Por eso no les conviene" \
                                         "un tres impredecible y un cinco dinámico infatigable. También debes evitar al soñador idealista con" \
                                         "El número 9, ya que los cuatro molestarán su frivolidad, porque son de carácter práctico y" \
                                         "a la tierra. Pero el ideal es una enfermedad grave, se centró en la importancia de la unidad y con un propósito ocho." \
                                         "Y si te salgas con cuatro cuidado, buena seis, que definitivamente van a ser una familia fuerte con muchos niños." \
                                         "Esta pareja podrá construir un futuro familiar feliz. Una relación muy dinámica y equilibrada" \
                                         "Se espera un cuatro con un siete. Agregará espiritualidad, ensueño y una especie de misterio a una naturaleza realista"
                if int(summa_recipient5) == 5:
                    text_for_recipient = "A 5 es el tipo de persona que necesita variedad y cambio, por lo que deben evitar a las personas predecibles", \
                                         "Simplemente se aburrirán con ellos. Una unidad audaz y autoritaria y un trío alegre y divertido son perfectos" \
                                         "Sólo habrá una relación ideal con los siete. Los cinco dinámicos, impacientes y los misteriosos siete silenciosos" \
                                         "se equilibrarán entre sí. \n " \
                                         "4, 8 y 9 son socios indeseables para los cinco. Con 4 te aburrirás, excesiva responsabilidad" \
                                         "9 será molesto, y el decidido 8 será molesto con sus infinitos planes y metas"
                if int(summa_recipient5) == 6:
                    text_for_recipient = "Las personas con un número de destino 6 tienen suerte, todos los rasgos son perfectos para cualquier otro número de destino" \
                                         "Pueden construir fácilmente relaciones sólidas a largo plazo. Saben cómo sacrificar algo por amor", \
                                         "para adaptarse a las necesidades de su pareja, son cariñosos y cariñosos. Si salen" \
                                         "un diablo, que es una naturaleza tierna emocional, solo están esperando una relación perfecta. Lo harán" \
                                         "Amarnos y deleitarnos constantemente. Con el resto de los números, también construirán una relación armoniosa" \
                                         "gracias al cariño, cariño y cariño"
                if int(summa_recipient5) == 7:
                    text_for_recipient = "Los Siete tienen expectativas muy altas, lo que puede dificultarles la elección del socio adecuado" \
                                         "Uno y ocho dominarán. Dos es demasiado emocional y sensible, y nueve" \
                                         "ama demasiado la soledad. Sin embargo, los sietes no están obsesionados con el amor y las relaciones, saben cómo alegrarse" \
                                         "la vida y sin pareja, se sienten cómodos y bien. Serán interesantes con la pareja que simplemente los sorprenderá" \
                                         "con su inteligencia y sentido del humor, y comprenderán que necesitan un espacio personal cuando quieran estar" \
                                         "a solas contigo mismo. El compañero más adecuado para sietes puede ser 3 o 5. Creativo y ligero tres," \
                                         "al igual que un cinco inteligente e impredecible siempre motivará. Y siete son exactamente lo que necesitan en una relación"
                if int(summa_recipient5) == 8:
                    text_for_recipient = "Es importante para los Ocho que todo esté bajo su control, incluidas las relaciones. Están acostumbrados a ser líderes y" \
                                         "Autoridad. No saben cómo buscar compromisos, por eso, a menudo surgen problemas en su vida personal" \
                                         "Un deuce suave y gentil les vendrá bien, así como un seis amoroso y sacrificado. \n " \
                                         "Una unidad fuerte independiente no es un socio adecuado para los ocho, competirán por el liderazgo en" \
                                         "Relaciones, están a la espera de constantes disputas y conflictos. Los amantes de la libertad 5 tampoco son adecuados, los ocho serán" \
                                         "limitarlo y eventualmente perderlo. \n " \
                                         "La mejor opción es un cuatro. Ambos tienen una naturaleza práctica bastante realista, disciplinada y" \
                                         "Individuos decididos que se guían por la lógica. Tienen mucho en común, no solo tendrán éxito" \
                                         "en la vida personal, pero también en los negocios, ¡para que pueda iniciar un negocio familiar de forma segura! \n "
                if int(summa_recipient5) == 9:
                    text_for_recipient = "Los nueves son la naturaleza más misteriosa y compleja de todas las anteriores. Son una naturaleza bastante reservada," \
                                         "Le gusta estar solo, evita hablar mucho de sus sentimientos y vivencias. Están de acuerdo con esos" \
                                         "personas que respetan su privacidad y siempre saben exactamente cuándo quieren estar solos. \n " \
                                         "Un dos sensible y un seis amoroso son muy adecuados para los nueves. Sorprendentemente, los tres también están cerca de ellos", \
                                         "Son tanto creativos como artísticos, tienen una imaginación rica, un sentido del humor inusual. Definitivamente lo serán", \
                                         "de qué hablar entre nosotros"
                telegraph.create_account(short_name='совместимость')
                response = telegraph.create_page(
                    f'Compatibilidad de fecha de nacimiento {user.birthday.replace(" ", ".")} y {date_copy}',
                    html_content=f'<b>📅Tu fecha: {user.birthday.replace(" ", ".")}</b><br>'
                                 f'<b>📅Fecha del socio: {date_copy}</b><br>'
                                 f'<br>'
                                 f'🔮<b>Destino total: {summa5}</b><br>'
                                 f'{text}<br>'
                                 f'<br>'
                                 f'🔮<b>Tu número de destino: {summa_user5}</b><br>'
                                 f'{text_for_user}<br>'
                                 f'<br>'
                                 f'🔮<b>Número de destino del socio: {summa_recipient5}</b><br>'
                                 f'{text_for_recipient}'
                )
                print(response)
                link = 'http://telegra.ph/{}'.format(response['path'])
                msg_text = hlink(" ", link)
                await message.answer(f"Resultado del{msg_text}cálculo:", reply_markup=back_compatibility_es)
            if user.language == "de":
                date = message.text
                date_copy = date
                date_split = date.split()
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 1) or (
                        int(date_split[0]) <= 19 and int(date_split[1]) == 2):
                    recipient_zodiac = "Aquarius"
                if (int(date_split[0]) >= 20 and int(date_split[1]) == 2) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 3):
                    recipient_zodiac = "Pisces"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 3) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 4):
                    recipient_zodiac = "Aries"
                if (int(date_split[0]) >= 21 and int(date_split[1]) == 4) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 5):
                    recipient_zodiac = "Taurus"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 5) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 6):
                    recipient_zodiac = "Gemini"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 6) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 7):
                    recipient_zodiac = "Cancer"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 7) or (
                        int(date_split[0]) <= 21 and int(date_split[1]) == 8):
                    recipient_zodiac = "Leo"
                if (int(date_split[0]) >= 22 and int(date_split[1]) == 8) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 9):
                    recipient_zodiac = "Virgo"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 9) or (
                        int(date_split[0]) <= 23 and int(date_split[1]) == 10):
                    recipient_zodiac = "Libra"
                if (int(date_split[0]) >= 24 and int(date_split[1]) == 10) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 11):
                    recipient_zodiac = "Scorpio"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 11) or (
                        int(date_split[0]) <= 22 and int(date_split[1]) == 12):
                    recipient_zodiac = "Sagittarius"
                if (int(date_split[0]) >= 23 and int(date_split[1]) == 12) or (
                        int(date_split[0]) <= 20 and int(date_split[1]) == 1):
                    recipient_zodiac = "Capricorn"
                user_zodiac = user.zodiac
                user = await qc.get_user(id=int(message.from_user.id))
                try:
                    date = date.replace(",", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace(".", " ")
                except:
                    print("нет такого символа для замены")
                try:
                    date = date.replace("/", " ")
                except:
                    print("нет такого символа для замены")
                date_split = date.split()
                date = date.replace(" ", "")
                summa = 0
                summa1 = 0
                summa2 = 0
                summa3 = 0
                summa4 = 0
                summa5 = 0
                summa_user = 0
                summa_user1 = 0
                summa_user2 = 0
                summa_user3 = 0
                summa_user4 = 0
                summa_user5 = 0
                summa_recipient = 0
                summa_recipient1 = 0
                summa_recipient2 = 0
                summa_recipient3 = 0
                summa_recipient4 = 0
                summa_recipient5 = 0
                for i in user.birthday.replace(' ', ''):
                    summa_user += int(i)
                for i in str(summa_user):
                    summa_user1 += int(i)
                for i in str(summa_user1):
                    summa_user2 += int(i)
                for i in str(summa_user2):
                    summa_user3 += int(i)
                for i in str(summa_user3):
                    summa_user4 += int(i)
                for i in str(summa_user4):
                    summa_user5 += int(i)
                for i in date:
                    summa_recipient += int(i)
                for i in str(summa_recipient):
                    summa_recipient1 += int(i)
                for i in str(summa_recipient1):
                    summa_recipient2 += int(i)
                for i in str(summa_recipient2):
                    summa_recipient3 += int(i)
                for i in str(summa_recipient3):
                    summa_recipient4 += int(i)
                for i in str(summa_recipient4):
                    summa_recipient5 += int(i)
                for i in user.birthday.replace(' ', ''):
                    summa1 += int(i)
                for i in date:
                    summa1 += int(i)
                for i in str(summa1):
                    summa2 += int(i)
                for i in str(summa2):
                    summa3 += int(i)
                for i in str(summa3):
                    summa4 += int(i)
                for i in str(summa4):
                    summa5 += int(i)
                if summa5 == 1:
                    text = "Das Wichtigste für eine solche Allianz ist, gemeinsam zu handeln. Hier offenbart sich das innere Potenzial des anderen." \
                           "Solche Beziehungen helfen Gesamtentwicklung. Wir dürfen nicht vergessen , dass man die Nummer des Führers ist, so dass sie" \
                           "Es kann zu Missverständnissen aufgrund der Gewaltenteilung in einer Beziehung kommen. Es kann zu Streitigkeiten und einem Showdown kommen." \
                           "Daher muss einer der Partner nur lernen, dem anderen zu gehorchen, dann das Familienleben" \
                           "und das Geschäft wird harmonischer."
                if summa5 == 2:
                    text = "So ein Paar wird auf einer materiellen Basis gehalten. Die Leute kommunizieren gerne miteinander, aber sie sind dabei" \
                           "Dies geschieht hauptsächlich aus Profitgründen, denn gemeinsam haben sie Glück. Das ist mit der Zeit nicht zu leugnen" \
                           "Sie können eine Familie mit gutem Einkommen bekommen. Auch hier wird alles stabil sein. Aber auch wenn Sie nur führen" \
                           "Geschäft, Ihr Unternehmen wird florieren. Es muss daran erinnert werden, dass zwei eine irdische Zahl ist, also ist es nicht" \
                           "Lebhafte Gefühle sind charakteristisch. Es kann sogar zu Konflikten um Geld kommen. Eine solche Verbindung mag keine Veränderungen und Romantik."
                if summa5 == 3:
                    text = "Die Hauptbestandteile dieser Vereinigung sind die Fähigkeit zu kommunizieren und wankelmütig zu sein. Langweilig wird es hier nicht. Ich würde gerne" \
                           "zu beachten , dass die freundschaftlichen Beziehungen wären besser geeignet , in diesem Fall, da in einer Familie mit dieser Figur ist" \
                           "Kälte. Versprechen werden einander gemacht und nicht gehalten. Es kann auf beiden Seiten Verrat geben. Das ist vielleicht" \
                           "Die schwierigste Zahl, um kompatibel zu sein."
                if summa5 == 4:
                    text = "Organisation, Regelmäßigkeit, Beständigkeit, Komfort sind die Bestandteile dieser Vereinigung. Die Familie wird sein" \
                           "Wärme und Wohlbefinden ausstrahlen. Wärme in Beziehungen macht sie aufrichtig. Übermäßige Energie kann" \
                           "Einmischen in das Geschäftsleben von Paaren, wo die Hauptsache ist - es ist eine spirituelle Bereicherung, neue Erfahrungen zu sammeln" \
                           "aber die Unfähigkeit, Kapital zu erhöhen."
                if summa5 == 5:
                    text = "Eine der sexiesten Gewerkschaften, in der die Leidenschaften hoch gehen. Partner geben sich gegenseitig viele angenehme Dinge" \
                           "Momente. Alles basiert nur auf Liebe. Aber das sind ein paar Egoisten. Wir müssen lernen, nicht nur zuzuhören, sondern auch" \
                           "sich zu hören, dann wird alles gut und glückliche Kinder werden in der Familie auftauchen. Überschüssige Energie kann" \
                           "auf jede Branche im Geschäft ausgerichtet sein und erfolgreich genug sein."
                if summa5 == 6:
                    text = "Gegenseitige Hilfe und Partnerschaft sind die wichtigsten Glieder dieses Paares. Dies ist auch eine irdische Zahl, daher die Beziehung" \
                           "sind langfristig. Für Geschäfte einfach eine ideale Option. In der Familie - Ruhe, Freundschaft, sehr" \
                           "selten - ein Showdown. Gefühle können verschwinden, aber die Unterstützung füreinander wird bleiben."
                if summa5 == 7:
                    text = "Die Grundlage dieser Vereinigung ist Harmonie. Partner wissen, wie man verhandelt. Es ist unmöglich, nicht zu bemerken, dass sie hier können" \
                           "vergessen Sie die Erfüllung vertraglicher Verpflichtungen. Obwohl Skandale praktisch nicht beobachtet werden, hilft es" \
                           "ein Taktgefühl, das nicht zum Abbruch der Beziehungen führt. Solche Allianzen sind durchaus erfolgreich. Gemeinsam gelöst" \
                           "alle Probleme, sowohl familiär als auch materiell."
                if summa5 == 8:
                    text = "Es gibt einige Kuriosität in diesem Paar, könnte man sogar sagen , Nicht-Standard. Menschen zu gezogen werden" \
                           "aneinander. Ein Partner kann dank dieser Anziehung den anderen drängen und ihm so helfen" \
                           "werden in Unternehmen realisiert werden . Aber auch hier innere Unzufriedenheit kann erscheinen, wenn der erste versteht" \
                           "dass er aus Eigennutz für etwas verwendet wird. Wenn es einen Streit gibt, kann er sich entwickeln zu" \
                           "ein riesiger Skandal. Wir müssen lernen, das Selbstwertgefühl zu steigern. Bei einem Paar ist Eifersucht möglich. Das müssen Sie sein" \
                           "Flexibel in dieser Gewerkschaft, dann wird alles klappen."
                if summa5 == 9:
                    text = "Das philosophischste Paar. Wenn hier materiell alles gut läuft, haben wir ein ideales" \
                           "Paar. Nun, bei einer schwachen finanziellen Situation brechen die Beziehungen zusammen. Daher ist es besser, hier Freunde zu sein und nicht" \
                           "eine Familie Vereinigung zu schaffen, da Alltag sowohl absorbieren und in verschiedenen Richtungen auflösen. Wenn doch," \
                           "Die Ehe ist der Fall, stellen Sie sicher, dass einer der Partner die vielen Probleme des Alltags übernimmt." \
                           "Dann wird die Union harmonisch sein."
                if int(summa_user5) == 1:
                    text_for_user = "Personen Nummer 1 sind es gewohnt, in jeder Hinsicht eine Führungspersönlichkeit zu sein, sie denken, dass ihre Meinung am meisten ist" \
                                    "was richtig ist und die Entscheidungen, die sie treffen, sind die richtigen. Dies kann sich negativ auswirken" \
                                    "Beziehung. Alles soll sein, wie sie wollen, nehmen Sie nicht den Standpunkt des anderen Partners ein. Ihr Ideal" \
                                    "ein Partner mit einer Schicksalszahl von 3 oder 5. Das sind die Menschen, die eine so herrschsüchtige Natur richtig angehen" \
                                    "wie du. Ein Partner mit einer Schicksalszahl von 3 ist ein einfaches und unbeschwertes Wesen. Er entscheidet nicht gerne etwas, also wird er es tun" \
                                    "Ich bin nur froh, wenn nicht alle wichtigen Entscheidungen von ihnen getroffen werden. Und ein Mensch mit einer Schicksalszahl 5 ist ein sehr flexibles Wesen." \
                                    "Er weiß, wie man Kompromisse findet, verleiht Beziehungen etwas Dynamik und positive Energie und ist eine ernsthafte Einheit." \
                                    "Falls er in seinen Bann zieht, wird es unbeschwerter und macht mehr Spaß. Außerdem passen Menschen mit der Nummer 1 zu einem Partner mit der Nummer 6." \
                                    "Aber er passt zu allen Schicksalen, weil er die harmonischste Natur ist, die jeder Beziehung Freundlichkeit, Trost und Glück bringt. \n " \
                                    "Menschen mit der Nummer 1 sollten sich nicht mit Achtern und anderen treffen. Beide Zahlen lieben Autorität, daher erwarten sie häufige Kontroversen und" \
                                    "Konflikte darüber, wer das Sagen hat, denn auf einem Schiff kann es nicht zwei Kapitäne geben."
                if int(summa_user5) == 2:
                    text_for_user = "Die Person Nummer 2 ist eine sehr zerbrechliche emotionale Person, die dennoch geschickte Manipulationen in Beziehungen anwendet ." \
                                    "Die harmonischste Beziehung wird von einer Person erwartet, deren Schicksal 8 oder 9 ist. Eine entschlossene und autoritäre Acht" \
                                    "passt gut zum sanften Charakter einer 2. Ein Partner mit einer Schicksalszahl von 9 ist ein liebevoller Verteidiger. Eine Person mit einer Nummer 2 wird es tun" \
                                    "so eine Person.\n " \
                                    "Ein bodenständiger und emotional abhängiger Vierer oder ein ernsthafter introvertierter Siebener kann ein gutes Paar für eine Person Nummer 2 sein " \
                                    "aber nicht lange, denn bei so einer Beziehung wird ihm schnell langweilig \n" \
                                    "Wenn eine Person mit der Nummer 2 auf eine Person trifft, deren Schicksalsnummer 1 ist, gibt es nur dann harmonische Beziehungen, wenn" \
                                    "wenn ihre Rollen klar zugewiesen sind. Wir müssen akzeptieren, dass die Einheit das letzte Wort hat, aber die Zwei als großartiger Manipulator." \
                                    "wird bestimmen, was dieses letzte Wort sein wird."
                if int(summa_user5) == 3:
                    text_for_user = "Für Menschen mit einer Schicksalszahl von 3 ist der ideale Partner 5 oder 7.\n " \
                                    "Eine tapfere Fünf, liebevolle Abenteuer und helle Ereignisse, sehr geeignet für Unberechenbarkeit und Chaos" \
                                    "Drei. Der ruhige Introvertierte 7, der Mystik und Mysterium liebt, wird Beziehungen Tiefe und Bewusstsein verleihen." \
                                    "Dies ist die Art von Kompatibilität, bei der Partner nicht nur gut miteinander auskommen, sondern sich auch ergänzen und verstehen. \n " \
                                    "Menschen mit einer Schicksalszahl von 3 sollten die praktische Vier vermeiden. Ein solches Paar wird sich nur ineinander sehen" \
                                    "schlechte Eigenschaften. Eine Drei kann sich für eine attraktive und starke Acht interessieren, aber am Ende" \
                                    "wird Kritik nicht vertragen und die Beziehung wird schnell enden."
                if int(summa_user5) == 4:
                    text_for_user = " Vierer brauchen starke, langfristige Beziehungen wie kein anderer. Das liegt alles daran, dass sie von Natur aus sind" \
                                    "praktisch und stabil. Gelassenheit im Alltag und Routine in einer Beziehung. Deshalb wird es ihnen nicht passen" \
                                    "eine unberechenbare Drei und eine dynamische, unermüdliche Fünf. Vermeiden Sie auch den idealistischen Träumer mit" \
                                    "die Zahl 9, da die vier seine Frivolität ärgern werden, weil sie praktischer Natur sind und" \
                                    "bodenständig. Aber das Perfekte ist eine ernsthafte, auf die Bedeutung der Einheit fokussierte und zielgerichtete Acht." \
                                    "Und wenn du mit vier fürsorglichen, guten sechs davon kommst, werden sie definitiv eine starke Familie mit vielen Kindern." \
                                    "Dieses Paar wird in der Lage sein, eine glückliche Familienzukunft aufzubauen. Eine sehr dynamische und ausgewogene Beziehung" \
                                    "Eine Vier wird mit einer Sieben erwartet. Es wird Spiritualität, Verträumtheit und eine Art Geheimnis zu einer bodenständigen Natur hinzufügen."
                if int(summa_user5) == 5:
                    text_for_user = "Fünf ist die Art von Person, die Abwechslung und Veränderung braucht, also müssen sie vorhersehbare Menschen meiden." \
                                    "Sie werden sich einfach langweilen. Eine mutige, autoritäre Einheit und ein fröhliches, lustiges Trio sind perfekt." \
                                    "Es wird nur eine ideale Beziehung zu den Sieben geben. Die dynamische, ungeduldige Fünf und die stille, mysteriöse Sieben" \
                                    "wird sich gegenseitig ausgleichen.\n " \
                                    "4, 8 und 9 sind unerwünschte Partner für die Fünf. Mit 4 werden Sie sich langweilen, übermäßige Verantwortung" \
                                    "9 wird ärgerlich sein, und zielgerichtete 8 wird mit ihren endlosen Plänen und Zielen ärgerlich sein."
                if int(summa_user5) == 6:
                    text_for_user = "Menschen mit einer Schicksalszahl 6 haben Glück, alle Eigenschaften sind perfekt für jede andere Schicksalsnummer." \
                                    "Sie können leicht langfristige, starke Beziehungen aufbauen. Sie wissen, wie man der Liebe etwas opfert." \
                                    "um sich an die Bedürfnisse ihres Partners anzupassen, sie sind fürsorglich und liebevoll. Wenn sie sich verabreden" \
                                    "eine Zwei, die eine emotionale zärtliche Natur ist, sie warten nur auf eine perfekte Beziehung. Sie werden" \
                                    "sich ständig zu lieben und zu erfreuen. Mit dem Rest der Zahlen werden sie auch eine harmonische Beziehung aufbauen" \
                                    "Dank Liebe, Zuneigung und Fürsorge."
                if int(summa_user5) == 7:
                    text_for_user = " Sieben haben sehr hohe Erwartungen, was es ihnen schwer machen kann, den richtigen Partner zu finden." \
                                    "Eins und acht werden dominieren. Zwei ist zu emotional und sensibel, und neun" \
                                    "er liebt die Einsamkeit zu sehr. Trotzdem sind Siebener nicht auf Liebe und Beziehungen fixiert, sie wissen, wie man sich freut" \
                                    "Leben und ohne Partner fühlen sie sich wohl und wohl. Sie werden mit dem Partner interessant sein, der sie einfach in Erstaunen versetzen wird" \
                                    "mit ihrer Intelligenz und ihrem Sinn für Humor und werden verstehen, dass sie persönlichen Freiraum brauchen, wenn sie es wollen" \
                                    "Allein mit sich selbst. Der am besten geeignete Partner für Siebener kann 3 oder 5 sein. Kreative und leichte Drei" \
                                    "Genau wie eine intelligente, unberechenbare Fünf immer motivieren wird. Und Siebener sind genau das, was sie in einer Beziehung brauchen."
                if int(summa_user5) == 8:
                    text_for_user = "Für die Acht ist es wichtig, dass alles unter ihrer Kontrolle ist, auch die Beziehung. Sie sind es gewohnt, Anführer zu sein und" \
                                    "Autorität. Sie wissen nicht, wie sie Kompromisse suchen sollen, deshalb treten oft Probleme in ihrem persönlichen Leben auf." \
                                    "Eine sanfte und sanfte Zwei wird ihnen ebenso passen wie eine liebevolle und aufopfernde Sechs. \n " \
                                    "Eine unabhängige starke Einheit ist kein geeigneter Partner für die Achter, sie werden um die Führung konkurrieren" \
                                    "Beziehungen, sie warten auf ständige Streitigkeiten und Konflikte. Freiheitsliebende 5 ist auch nicht geeignet, die acht werden sein" \
                                    "begrenzen Sie es und verlieren Sie es schließlich.\n " \
                                    "Die beste Option ist eine Vier. Sie sind beide ziemlich bodenständig, praktisch, diszipliniert und" \
                                    "zielstrebige Menschen, die von Logik geleitet werden. Sie haben viel gemeinsam, sie werden nicht nur erfolgreich sein" \
                                    "im Privatleben, aber auch im Geschäft, damit Sie sicher ein Familienunternehmen gründen können!\n "
                if int(summa_user5) == 9:
                    text_for_user = "Neunen sind die mysteriöseste und komplexeste Natur von allen oben. Sie sind eine eher geheimnisvolle Natur. " \
                                    "er ist gerne allein, vermeidet es, viel über seine Gefühle und Erfahrungen zu sprechen. Sie stimmen damit überein" \
                                    "Menschen, die ihre Privatsphäre respektieren und immer genau wissen, wann sie allein sein wollen.\n " \
                                    "Ein sensibler Zweier und ein liebevoller Sechser passen sehr gut zu Neunern. Überraschenderweise stehen die Drei ihnen auch nahe. " \
                                    "Sie sind sowohl kreativ als auch künstlerisch, sie haben eine reiche Vorstellungskraft und einen ungewöhnlichen Sinn für Humor. Das werden sie auf jeden Fall sein." \
                                    "worüber man miteinander reden soll."
                if int(summa_recipient5) == 1:
                    text_for_recipient = "Personen der Nummer 1 sind es gewohnt, in jeder Hinsicht eine Führungspersönlichkeit zu sein, sie denken, dass ihre Meinung am meisten ist" \
                                         "was richtig ist und die Entscheidungen, die sie treffen, sind die richtigen. Dies kann sich negativ auswirken" \
                                         "Beziehung. Alles soll sein, wie sie wollen, nehmen Sie nicht den Standpunkt des anderen Partners ein. Ihr Ideal" \
                                         "ein Partner mit einer Schicksalszahl von 3 oder 5. Das sind die Menschen, die eine so herrschsüchtige Natur richtig angehen" \
                                         "wie du. Ein Partner mit einer Schicksalszahl von 3 ist ein einfaches und unbeschwertes Wesen. Er entscheidet nicht gerne etwas, also wird er es tun" \
                                         "Ich bin nur froh, wenn nicht alle wichtigen Entscheidungen von ihnen getroffen werden. Und ein Mensch mit einer Schicksalszahl 5 ist ein sehr flexibles Wesen." \
                                         "Er weiß, wie man Kompromisse findet, verleiht Beziehungen etwas Dynamik und positive Energie und ist eine ernsthafte Einheit. " \
                                         "Falls er in seinen Bann zieht, wird es unbeschwerter und macht mehr Spaß. Außerdem passen Menschen mit der Nummer 1 zu einem Partner mit der Nummer 6." \
                                         "Aber er passt zu allen Schicksalen, weil er die harmonischste Natur ist, die jeder Beziehung Freundlichkeit, Trost und Glück bringt. \n " \
                                         "Menschen mit der Nummer 1 sollten sich nicht mit Achtern und anderen treffen. Beide Zahlen lieben Autorität, daher erwarten sie häufige Kontroversen und" \
                                         "Konflikte darüber, wer das Sagen hat, denn auf einem Schiff kann es nicht zwei Kapitäne geben."
                if int(summa_recipient5) == 2:
                    text_for_recipient = "Person Nummer 2 ist eine sehr zerbrechliche emotionale Person, die dennoch geschickte Manipulationen in Beziehungen anwendet . " \
                                         "Die harmonischste Beziehung wird von einer Person erwartet, deren Schicksal 8 oder 9 ist. Eine entschlossene und autoritäre Acht" \
                                         "passt gut zum sanften Charakter einer 2. Ein Partner mit einer Schicksalszahl von 9 ist ein liebevoller Verteidiger. Eine Person mit einer Nummer 2 wird es tun" \
                                         "so eine Person.\n " \
                                         "Ein bodenständiger und emotional abhängiger Vierer oder ein ernsthafter introvertierter Siebener kann ein gutes Paar für eine Person Nummer 2 sein" \
                                         "aber nicht lange, denn bei so einer Beziehung wird ihm schnell langweilig \n " \
                                         "Wenn eine Person mit der Nummer 2 auf eine Person trifft, deren Schicksalsnummer 1 ist, gibt es nur dann harmonische Beziehungen, wenn" \
                                         "wenn ihre Rollen klar zugewiesen sind. Wir müssen akzeptieren, dass die Einheit das letzte Wort hat, aber die Zwei als großartiger Manipulator." \
                                         "wird bestimmen, was dieses letzte Wort sein wird."
                if int(summa_recipient5) == 3:
                    text_for_recipient = "Für Menschen mit einer Schicksalszahl von 3 ist der ideale Partner 5 oder 7.\n " \
                                         "Eine tapfere Fünf, liebevolle Abenteuer und helle Ereignisse, sehr geeignet für Unberechenbarkeit und Chaos" \
                                         "Drei. Der ruhige Introvertierte 7, der Mystik und Mysterium liebt, wird Beziehungen Tiefe und Bewusstsein verleihen. " \
                                         "Dies ist die Art von Kompatibilität, bei der Partner nicht nur gut miteinander auskommen, sondern sich auch ergänzen und verstehen. \n " \
                                         "Menschen mit einer Schicksalszahl von 3 sollten die praktische Vier vermeiden. Ein solches Paar wird sich nur ineinander sehen" \
                                         "schlechte Eigenschaften. Eine Drei kann sich für eine attraktive und starke Acht interessieren, aber am Ende" \
                                         "wird Kritik nicht vertragen und die Beziehung wird schnell enden."
                if int(summa_recipient5) == 4:
                    text_for_recipient = " Vierer brauchen starke langfristige Beziehungen wie kein anderer. Das liegt alles daran, dass sie von Natur aus sind. " \
                                         "praktisch und stabil. Gelassenheit im Alltag und Routine in einer Beziehung. Deshalb wird es ihnen nicht passen" \
                                         "eine unberechenbare Drei und eine dynamische, unermüdliche Fünf. Vermeiden Sie auch den idealistischen Träumer mit" \
                                         "die Zahl 9, da die vier seine Frivolität ärgern werden, weil sie praktischer Natur sind und" \
                                         "bodenständig. Aber das Perfekte ist eine ernsthafte, auf die Bedeutung der Einheit fokussierte und zielgerichtete Acht. " \
                                         "Und wenn du mit vier fürsorglichen, guten sechs davon kommst, werden sie definitiv eine starke Familie mit vielen Kindern. " \
                                         "Dieses Paar wird in der Lage sein, eine glückliche Familienzukunft aufzubauen. Eine sehr dynamische und ausgewogene Beziehung" \
                                         "Eine Vier wird mit einer Sieben erwartet. Es wird Spiritualität, Verträumtheit und eine Art Geheimnis zu einer bodenständigen Natur hinzufügen."
                if int(summa_recipient5) == 5:
                    text_for_recipient = "Eine 5 ist die Art von Person, die Abwechslung und Veränderung braucht, also müssen sie vorhersehbare Menschen meiden. " \
                                         "Sie werden sich einfach langweilen. Eine mutige, autoritäre Einheit und ein fröhliches, lustiges Trio sind perfekt." \
                                         "Es wird nur eine ideale Beziehung zu den Sieben geben. Die dynamische, ungeduldige Fünf und die stille, mysteriöse Sieben" \
                                         "wird sich gegenseitig ausgleichen.\n " \
                                         "4, 8 und 9 sind unerwünschte Partner für die Fünf. Mit 4 werden Sie sich langweilen, übermäßige Verantwortung" \
                                         "9 wird ärgerlich sein, und zielgerichtete 8 wird mit ihren endlosen Plänen und Zielen ärgerlich sein."
                if int(summa_recipient5) == 6:
                    text_for_recipient = "Menschen mit einer Schicksalszahl 6 haben Glück, alle Eigenschaften sind perfekt für jede andere Schicksalsnummer." \
                                         "Sie können leicht langfristige, starke Beziehungen aufbauen. Sie wissen, wie man der Liebe etwas opfert." \
                                         "um sich an die Bedürfnisse ihres Partners anzupassen, sie sind fürsorglich und liebevoll. Wenn sie sich verabreden" \
                                         "eine Zwei, die eine emotionale zärtliche Natur ist, sie warten nur auf eine perfekte Beziehung. Sie werden" \
                                         "sich ständig zu lieben und zu erfreuen. Mit dem Rest der Zahlen werden sie auch eine harmonische Beziehung aufbauen" \
                                         "Dank Liebe, Zuneigung und Fürsorge."
                if int(summa_recipient5) == 7:
                    text_for_recipient = " Sieben haben sehr hohe Erwartungen, was es ihnen schwer machen kann, den richtigen Partner zu finden." \
                                         "Eins und acht werden dominieren. Zwei ist zu emotional und sensibel, und neun" \
                                         "er liebt die Einsamkeit zu sehr. Trotzdem sind Siebener nicht auf Liebe und Beziehungen fixiert, sie wissen, wie man sich freut" \
                                         "Leben und ohne Partner fühlen sie sich wohl und wohl. Sie werden mit dem Partner interessant sein, der sie einfach in Erstaunen versetzen wird" \
                                         "mit ihrer Intelligenz und ihrem Sinn für Humor und werden verstehen, dass sie persönlichen Freiraum brauchen, wenn sie es wollen" \
                                         "Allein mit sich selbst. Der am besten geeignete Partner für Siebener kann 3 oder 5 sein. Kreative und leichte Drei" \
                                         "Genau wie eine intelligente, unberechenbare Fünf immer motivieren wird. Und Siebener sind genau das, was sie in einer Beziehung brauchen."
                if int(summa_recipient5) == 8:
                    text_for_recipient = "Für die Acht ist es wichtig, dass alles unter ihrer Kontrolle ist, einschließlich der Beziehungen. Sie sind es gewohnt, Anführer zu sein und" \
                                         "Autorität. Sie wissen nicht, wie sie Kompromisse suchen sollen, deshalb treten oft Probleme in ihrem persönlichen Leben auf." \
                                         "Eine sanfte und sanfte Zwei wird ihnen ebenso passen wie eine liebevolle und aufopfernde Sechs. \n " \
                                         "Eine unabhängige starke Einheit ist kein geeigneter Partner für die Achter, sie werden um die Führung konkurrieren" \
                                         "Beziehungen, sie warten auf ständige Streitigkeiten und Konflikte. Freiheitsliebende 5 ist auch nicht geeignet, die acht werden sein" \
                                         "begrenzen Sie es und verlieren Sie es schließlich.\n " \
                                         "Die beste Option ist eine Vier. Sie sind beide ziemlich bodenständig, praktisch, diszipliniert und" \
                                         "zielstrebige Menschen, die von Logik geleitet werden. Sie haben viel gemeinsam, sie werden nicht nur erfolgreich sein" \
                                         "im Privatleben, aber auch im Geschäft, damit Sie sicher ein Familienunternehmen gründen können!\n "
                if int(summa_recipient5) == 9:
                    text_for_recipient = "Neunen sind die mysteriöseste und komplexeste Natur von allen oben. Sie sind eine eher geheimnisvolle Natur. " \
                                         "er ist gerne allein, vermeidet es, viel über seine Gefühle und Erfahrungen zu sprechen. Sie stimmen damit überein" \
                                         "Menschen, die ihre Privatsphäre respektieren und immer genau wissen, wann sie allein sein wollen.\n " \
                                         "Ein sensibler Zweier und ein liebevoller Sechser passen sehr gut zu Neunern. Überraschenderweise stehen die Drei ihnen auch nahe." \
                                         "Sie sind sowohl kreativ als auch künstlerisch, sie haben eine reiche Vorstellungskraft und einen ungewöhnlichen Sinn für Humor. Das werden sie auf jeden Fall sein." \
                                         "worüber man miteinander reden soll."
                telegraph.create_account(short_name='совместимость')
                response = telegraph.create_page(
                    f'Geburtsdatum Kompatibilität {user.birthday.replace(" ", ".")} und {date_copy}',
                    html_content=f'<b>📅Dein Datum: {user.birthday.replace(" ", ".")}</b><br>'
                                 f'<b>📅Partnerdatum: {date_copy}</b><br>'
                                 f'<br>'
                                 f'🔮<b>Totales Schicksal: {summa5}</b><br>'
                                 f'{text}<br>'
                                 f'<br>'
                                 f'🔮<b>Deine Schicksalsnummer: {summa_user5}</b><br>'
                                 f'{text_for_user}<br>'
                                 f'<br>'
                                 f'🔮<b>Nummer des Schicksals des Partners: {summa_recipient5}</b><br>'
                                 f'{text_for_recipient}'
                )
                print(response)
                link = 'http://telegra.ph/{}'.format(response['path'])
                msg_text = hlink(":", link)
                await message.answer(f"Berechnungsergebnis{msg_text}", reply_markup=back_compatibility_de)
            await state.finish()
    except:
        user = await qc.get_user(id=int(message.from_user.id))
        if user.language == "ru":
            await message.answer(f"Вы неправильно указали дату рождения, укажите ее в формате:\n"
                                 f"<b>дд.мм.гггг</b> или <b>дд,мм,гггг</b> или <b>дд/мм/гггг</b>", reply_markup=None)
        if user.language == "en":
            await message.answer(f"You entered your date of birth incorrectly, please enter it in the format:"
                                 f"<b>dd.mm.yyyy</b> or <b>dd,mm,yyyy</b> or <b>dd/mm/yyyy</b>", reply_markup=None)
        if user.language == "es":
            await message.answer(f"Ingresó incorrectamente su fecha de nacimiento, ingréselo en el formato:"
                                 f"<b>dd.mm.aaaa</b> o <b>dd,mm,aaaa</b> o <b>dd/mm/aaaa</b>", reply_markup=None)
        if user.language == "de":
            await message.answer(f"Sie haben Ihr Geburtsdatum falsch eingegeben, bitte geben Sie es im Format ein:"
                                 f"<b>dd.mm.yyyy</b> oder <b>dd,mm,yyyy</b> oder <b>dd/mm/yyyy</b>", reply_markup=None)


@dp.callback_query_handler(text="check_referrals", state="*")
async def def_check_referrals(call: types.CallbackQuery, state: FSMContext):
    await call.message.delete_reply_markup()
    referrals = await qc.select_referrals(id=call.from_user.id)
    user = await qc.get_user(id=call.from_user.id)
    x = 0
    text = f""
    for referreal in referrals:
        x += 1
        text += f"{x}) {referreal.fullname}\n"
    if user.language == "ru":
        if text == "":
            await call.message.answer(f"Пока что вы никого не пригласили", reply_markup=delete_msg_ru)
        else:
            await call.message.answer(f"Вы пригласили:\n"
                                      f"\n"
                                      f"{text}", reply_markup=delete_msg_ru)
    if user.language == "en":
        if text == "":
            await call.message.answer(f"You haven't invited anyone yet", reply_markup=delete_msg_en)
        else:
            await call.message.answer(f"You invited:\n"
                                      f"\n"
                                      f"{text}", reply_markup=delete_msg_en)
    if user.language == "es":
        if text == "":
            await call.message.answer(f"Aún no has invitado a nadie", reply_markup=delete_msg_es)
        else:
            await call.message.answer(f"Estas invitado:\n"
                                      f"\n"
                                      f"{text}", reply_markup=delete_msg_es)
    if user.language == "de":
        if text == "":
            await call.message.answer(f"Du hast noch niemanden eingeladen", reply_markup=delete_msg_de)
        else:
            await call.message.answer(f"Sie haben eingeladen:\n"
                                      f"\n"
                                      f"{text}", reply_markup=delete_msg_de)
    await state.finish()
